knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
	<peripheral>
      <name>AXIMC_Mx</name>
      <description>AXIMC_Mx</description>
      <groupName>AXIMC_Mx</groupName>
      <baseAddress>0x57042024</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AXIMC_M0_FN_MOD2</name>
          <displayName>AXIMC_M0_FN_MOD2</displayName>
          <description>AXIMC master 0 packing functionality register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_READ_QOS</name>
          <displayName>AXIMC_M0_READ_QOS</displayName>
          <description>AXIMC master 0 read priority register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_WRITE_QOS</name>
          <displayName>AXIMC_M0_WRITE_QOS</displayName>
          <description>AXIMC master 0 write priority register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_FN_MOD</name>
          <displayName>AXIMC_M0_FN_MOD</displayName>
          <description>AXIMC master 0 issuing capability override functionality register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_FN_MOD2</name>
          <displayName>AXIMC_M1_FN_MOD2</displayName>
          <description>AXIMC master 1 packing functionality register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_READ_QOS</name>
          <displayName>AXIMC_M1_READ_QOS</displayName>
          <description>AXIMC master 1 read priority register</description>
          <addressOffset>0x10DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_WRITE_QOS</name>
          <displayName>AXIMC_M1_WRITE_QOS</displayName>
          <description>AXIMC master 1 write priority register</description>
          <addressOffset>0x10E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_FN_MOD</name>
          <displayName>AXIMC_M1_FN_MOD</displayName>
          <description>AXIMC master 1 issuing capability override functionality register</description>
          <addressOffset>0x10E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_FN_MOD2</name>
          <displayName>AXIMC_M2_FN_MOD2</displayName>
          <description>AXIMC master 2 packing functionality register</description>
          <addressOffset>0x2000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_READ_QOS</name>
          <displayName>AXIMC_M2_READ_QOS</displayName>
          <description>AXIMC master 2 read priority register</description>
          <addressOffset>0x20DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_WRITE_QOS</name>
          <displayName>AXIMC_M2_WRITE_QOS</displayName>
          <description>AXIMC master 2 write priority register</description>
          <addressOffset>0x20E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_FN_MOD</name>
          <displayName>AXIMC_M2_FN_MOD</displayName>
          <description>AXIMC master 2 issuing capability override functionality register</description>
          <addressOffset>0x20E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_FN_MOD2</name>
          <displayName>AXIMC_M5_FN_MOD2</displayName>
          <description>AXIMC master 5 packing functionality register</description>
          <addressOffset>0x3000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_READ_QOS</name>
          <displayName>AXIMC_M5_READ_QOS</displayName>
          <description>AXIMC master 5 read priority register</description>
          <addressOffset>0x30DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_WRITE_QOS</name>
          <displayName>AXIMC_M5_WRITE_QOS</displayName>
          <description>AXIMC master 5 write priority register</description>
          <addressOffset>0x30E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_FN_MOD</name>
          <displayName>AXIMC_M5_FN_MOD</displayName>
          <description>AXIMC master 5 issuing capability override functionality register</description>
          <addressOffset>0x30E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_READ_QOS</name>
          <displayName>AXIMC_M3_READ_QOS</displayName>
          <description>AXIMC master 3 read priority register</description>
          <addressOffset>0x40DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_WRITE_QOS</name>
          <displayName>AXIMC_M3_WRITE_QOS</displayName>
          <description>AXIMC master 3 write priority register</description>
          <addressOffset>0x40E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_FN_MOD</name>
          <displayName>AXIMC_M3_FN_MOD</displayName>
          <description>AXIMC master 3 packing functionality register</description>
          <addressOffset>0x40E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_READ_QOS</name>
          <displayName>AXIMC_M7_READ_QOS</displayName>
          <description>AXIMC master 7 read priority register</description>
          <addressOffset>0x50DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_WRITE_QOS</name>
          <displayName>AXIMC_M7_WRITE_QOS</displayName>
          <description>AXIMC master 7 write priority register</description>
          <addressOffset>0x50E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_FN_MOD</name>
          <displayName>AXIMC_M7_FN_MOD</displayName>
          <description>AXIMC master 7 issuing capability override functionality register</description>
          <addressOffset>0x50E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M8_READ_QOS</name>
          <displayName>AXIMC_M8_READ_QOS</displayName>
          <description>AXIMC master 8 read priority register</description>
          <addressOffset>0x60DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M8_WRITE_QOS</name>
          <displayName>AXIMC_M8_WRITE_QOS</displayName>
          <description>AXIMC master 8 write priority register</description>
          <addressOffset>0x60E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M8_FN_MOD</name>
          <displayName>AXIMC_M8_FN_MOD</displayName>
          <description>AXIMC master 8 issuing capability override functionality register</description>
          <addressOffset>0x60E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
		 <register>
          <name>AXIMC_M4_FN_MOD2</name>
          <displayName>AXIMC_M4_FN_MOD2</displayName>
          <description>AXIMC master 4 packing functionality register</description>
          <addressOffset>0x8000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_READ_QOS</name>
          <displayName>AXIMC_M4_READ_QOS</displayName>
          <description>AXIMC master 4 read priority register</description>
          <addressOffset>0x80DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_WRITE_QOS</name>
          <displayName>AXIMC_M4_WRITE_QOS</displayName>
          <description>AXIMC master 4 write priority register</description>
          <addressOffset>0x80E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_FN_MOD</name>
          <displayName>AXIMC_M4_FN_MOD</displayName>
          <description>AXIMC master 4 packing functionality register</description>
          <addressOffset>0x80E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M9_READ_QOS</name>
          <displayName>AXIMC_M9_READ_QOS</displayName>
          <description>AXIMC master 9 read priority register</description>
          <addressOffset>0x90DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M9_WRITE_QOS</name>
          <displayName>AXIMC_M9_WRITE_QOS</displayName>
          <description>AXIMC master 9 write priority register</description>
          <addressOffset>0x90E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
