knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>      
    <peripheral>
      <name>DDRCTRL</name>
      <description>DDRCTRL</description>
      <groupName>DDRCTRL</groupName>
      <baseAddress>0x5A003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRCTRL_MSTR</name>
          <displayName>DDRCTRL_MSTR</displayName>
          <description>DDRCTRL master register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00040001</resetValue>
          <fields>
            <field>
              <name>DDR3</name>
              <description>DDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDDR2</name>
              <description>LPDDR2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDDR3</name>
              <description>LPDDR3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTCHOP</name>
              <description>BURSTCHOP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_2T_TIMING_MODE</name>
              <description>EN_2T_TIMING_MODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATA_BUS_WIDTH</name>
              <description>DATA_BUS_WIDTH</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DLL_OFF_MODE</name>
              <description>DLL_OFF_MODE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURST_RDWR</name>
              <description>BURST_RDWR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_STAT</name>
          <displayName>DDRCTRL_STAT</displayName>
          <description>DDRCTRL operating mode status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPERATING_MODE</name>
              <description>OPERATING_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SELFREF_TYPE</name>
              <description>SELFREF_TYPE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SELFREF_CAM_NOT_EMPTY</name>
              <description>SELFREF_CAM_NOT_EMPTY</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_MRCTRL0</name>
          <displayName>DDRCTRL_MRCTRL0</displayName>
          <description>Mode Register Read/Write Control Register 0. Do not enable more than one of the following fields simultaneously: sw_init_int pda_en mpr_en</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MR_TYPE</name>
              <description>MR_TYPE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR_RANK</name>
              <description>MR_RANK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR_ADDR</name>
              <description>MR_ADDR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MR_WR</name>
              <description>MR_WR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_MRCTRL1</name>
          <displayName>DDRCTRL_MRCTRL1</displayName>
          <description>DDRCTRL mode register read/write control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR_DATA</name>
              <description>MR_DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_MRSTAT</name>
          <displayName>DDRCTRL_MRSTAT</displayName>
          <description>DDRCTRL mode register read/write status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR_WR_BUSY</name>
              <description>MR_WR_BUSY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_DERATEEN</name>
          <displayName>DDRCTRL_DERATEEN</displayName>
          <description>DDRCTRL temperature derate enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DERATE_ENABLE</name>
              <description>DERATE_ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DERATE_VALUE</name>
              <description>DERATE_VALUE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DERATE_BYTE</name>
              <description>DERATE_BYTE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_DERATEINT</name>
          <displayName>DDRCTRL_DERATEINT</displayName>
          <description>DDRCTRL temperature derate interval register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>MR4_READ_INTERVAL</name>
              <description>MR4_READ_INTERVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PWRCTL</name>
          <displayName>DDRCTRL_PWRCTL</displayName>
          <description>DDRCTRL low power control register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SELFREF_EN</name>
              <description>SELFREF_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POWERDOWN_EN</name>
              <description>POWERDOWN_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEEPPOWERDOWN_EN</name>
              <description>DEEPPOWERDOWN_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_DFI_DRAM_CLK_DISABLE</name>
              <description>EN_DFI_DRAM_CLK_DISABLE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELFREF_SW</name>
              <description>SELFREF_SW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_CAM_DRAIN_SELFREF</name>
              <description>DIS_CAM_DRAIN_SELFREF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PWRTMG</name>
          <displayName>DDRCTRL_PWRTMG</displayName>
          <description>DDRCTRL low power timing register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00402010</resetValue>
          <fields>
            <field>
              <name>POWERDOWN_TO_X32</name>
              <description>POWERDOWN_TO_X32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>T_DPD_X4096</name>
              <description>T_DPD_X4096</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SELFREF_TO_X32</name>
              <description>SELFREF_TO_X32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_HWLPCTL</name>
          <displayName>DDRCTRL_HWLPCTL</displayName>
          <description>DDRCTRL hardware low power control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>HW_LP_EN</name>
              <description>HW_LP_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW_LP_EXIT_IDLE_EN</name>
              <description>HW_LP_EXIT_IDLE_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW_LP_IDLE_X32</name>
              <description>HW_LP_IDLE_X32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_RFSHCTL0</name>
          <displayName>DDRCTRL_RFSHCTL0</displayName>
          <description>DDRCTRL refresh control register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00210000</resetValue>
          <fields>
            <field>
              <name>PER_BANK_REFRESH</name>
              <description>PER_BANK_REFRESH</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFRESH_BURST</name>
              <description>REFRESH_BURST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>REFRESH_TO_X32</name>
              <description>REFRESH_TO_X32</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>REFRESH_MARGIN</name>
              <description>REFRESH_MARGIN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_RFSHCTL3</name>
          <displayName>DDRCTRL_RFSHCTL3</displayName>
          <description>DDRCTRL refresh control register 3</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIS_AUTO_REFRESH</name>
              <description>DIS_AUTO_REFRESH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFRESH_UPDATE_LEVEL</name>
              <description>REFRESH_UPDATE_LEVEL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_RFSHTMG</name>
          <displayName>DDRCTRL_RFSHTMG</displayName>
          <description>DDRCTRL refresh timing register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0062008C</resetValue>
          <fields>
            <field>
              <name>T_RFC_MIN</name>
              <description>T_RFC_MIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>LPDDR3_TREFBW_EN</name>
              <description>LPDDR3_TREFBW_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T_RFC_NOM_X1_X32</name>
              <description>T_RFC_NOM_X1_X32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>T_RFC_NOM_X1_SEL</name>
              <description>T_RFC_NOM_X1_SEL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_CRCPARCTL0</name>
          <displayName>DDRCTRL_CRCPARCTL0</displayName>
          <description>DDRCTRL CRC parity control register 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFI_ALERT_ERR_INT_EN</name>
              <description>DFI_ALERT_ERR_INT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_ALERT_ERR_INT_CLR</name>
              <description>DFI_ALERT_ERR_INT_CLR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_ALERT_ERR_CNT_CLR</name>
              <description>DFI_ALERT_ERR_CNT_CLR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_CRCPARSTAT</name>
          <displayName>DDRCTRL_CRCPARSTAT</displayName>
          <description>DDRCTRL CRC parity status register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFI_ALERT_ERR_CNT</name>
              <description>DFI_ALERT_ERR_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DFI_ALERT_ERR_INT</name>
              <description>DFI_ALERT_ERR_INT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT0</name>
          <displayName>DDRCTRL_INIT0</displayName>
          <description>DDRCTRL SDRAM initialization register 0</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0002004E</resetValue>
          <fields>
            <field>
              <name>PRE_CKE_X1024</name>
              <description>PRE_CKE_X1024</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>POST_CKE_X1024</name>
              <description>POST_CKE_X1024</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>SKIP_DRAM_INIT</name>
              <description>SKIP_DRAM_INIT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT1</name>
          <displayName>DDRCTRL_INIT1</displayName>
          <description>DDRCTRL SDRAM initialization register 1</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRE_OCD_X32</name>
              <description>PRE_OCD_X32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DRAM_RSTN_X1024</name>
              <description>DRAM_RSTN_X1024</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT2</name>
          <displayName>DDRCTRL_INIT2</displayName>
          <description>DDRCTRL SDRAM initialization register 2</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000D05</resetValue>
          <fields>
            <field>
              <name>MIN_STABLE_CLOCK_X1</name>
              <description>MIN_STABLE_CLOCK_X1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IDLE_AFTER_RESET_X32</name>
              <description>IDLE_AFTER_RESET_X32</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT3</name>
          <displayName>DDRCTRL_INIT3</displayName>
          <description>DDRCTRL SDRAM initialization register 3</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000510</resetValue>
          <fields>
            <field>
              <name>EMR</name>
              <description>EMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MR</name>
              <description>MR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT4</name>
          <displayName>DDRCTRL_INIT4</displayName>
          <description>DDRCTRL SDRAM initialization register 4</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EMR3</name>
              <description>EMR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>EMR2</name>
              <description>EMR2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_INIT5</name>
          <displayName>DDRCTRL_INIT5</displayName>
          <description>DDRCTRL SDRAM initialization register 5</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00100004</resetValue>
          <fields>
            <field>
              <name>MAX_AUTO_INIT_X1024</name>
              <description>MAX_AUTO_INIT_X1024</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>DEV_ZQINIT_X32</name>
              <description>DEV_ZQINIT_X32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_DIMMCTL</name>
          <displayName>DDRCTRL_DIMMCTL</displayName>
          <description>DDRCTRL DIMM control register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIMM_STAGGER_CS_EN</name>
              <description>DIMM_STAGGER_CS_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIMM_ADDR_MIRR_EN</name>
              <description>DIMM_ADDR_MIRR_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_DRAMTMG0</name>
          <displayName>DDRCTRL_DRAMTMG0</displayName>
          <description>DDRCTRL SDRAM timing register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F101B0F</resetValue>
          <fields>
            <field>
              <name>T_RAS_MIN</name>
              <description>T_RAS_MIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>T_RAS_MAX</name>
              <description>T_RAS_MAX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>T_FAW</name>
              <description>T_FAW</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>WR2PRE</name>
              <description>WR2PRE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
