knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
        <register>
          <name>DFSDM_FLT3CR2</name>
          <displayName>DFSDM_FLT3CR2</displayName>
          <description>DFSDM filter 3 control register 2</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JEOCIE</name>
              <description>JEOCIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCIE</name>
              <description>REOCIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRIE</name>
              <description>JOVRIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRIE</name>
              <description>ROVRIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDIE</name>
              <description>AWDIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCDIE</name>
              <description>SCDIE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABIE</name>
              <description>CKABIE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXCH</name>
              <description>EXCH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWDCH</name>
              <description>AWDCH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3ISR</name>
          <displayName>DFSDM_FLT3ISR</displayName>
          <description>DFSDM filter 3 interrupt and status register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00FF0000</resetValue>
          <fields>
            <field>
              <name>JEOCF</name>
              <description>JEOCF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCF</name>
              <description>REOCF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRF</name>
              <description>JOVRF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRF</name>
              <description>ROVRF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDF</name>
              <description>AWDF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JCIP</name>
              <description>JCIP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCIP</name>
              <description>RCIP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABF</name>
              <description>CKABF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCDF</name>
              <description>SCDF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3ICR</name>
          <displayName>DFSDM_FLT3ICR</displayName>
          <description>DFSDM filter 3 interrupt flag clear register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRJOVRF</name>
              <description>CLRJOVRF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRROVRF</name>
              <description>CLRROVRF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRCKABF</name>
              <description>CLRCKABF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRSCDF</name>
              <description>CLRSCDF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3JCHGR</name>
          <displayName>DFSDM_FLT3JCHGR</displayName>
          <description>DFSDM filter 3 injected channel group selection register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>JCHG</name>
              <description>JCHG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3FCR</name>
          <displayName>DFSDM_FLT3FCR</displayName>
          <description>DFSDM filter 3 control register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IOSR</name>
              <description>IOSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FOSR</name>
              <description>FOSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>FORD</name>
              <description>FORD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3JDATAR</name>
          <displayName>DFSDM_FLT3JDATAR</displayName>
          <description>DFSDM filter 3 data register for injected group</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATACH</name>
              <description>JDATACH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JDATA</name>
              <description>JDATA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3RDATAR</name>
          <displayName>DFSDM_FLT3RDATAR</displayName>
          <description>DFSDM filter 3 data register for the regular channel</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATACH</name>
              <description>RDATACH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>RPEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATA</name>
              <description>RDATA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3AWHTR</name>
          <displayName>DFSDM_FLT3AWHTR</displayName>
          <description>DFSDM filter 3 analog watchdog high threshold register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>BKAWH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>AWHT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3AWLTR</name>
          <displayName>DFSDM_FLT3AWLTR</displayName>
          <description>DFSDM filter 3 analog watchdog low threshold register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>BKAWL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>AWLT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3AWSR</name>
          <displayName>DFSDM_FLT3AWSR</displayName>
          <description>DFSDM filter 3 analog watchdog status register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>AWLTF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>AWHTF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3AWCFR</name>
          <displayName>DFSDM_FLT3AWCFR</displayName>
          <description>DFSDM filter 3 analog watchdog clear flag register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>CLRAWLTF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>CLRAWHTF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3EXMAX</name>
          <displayName>DFSDM_FLT3EXMAX</displayName>
          <description>DFSDM filter 3 extremes detector maximum register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>EXMAXCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>EXMAX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3EXMIN</name>
          <displayName>DFSDM_FLT3EXMIN</displayName>
          <description>DFSDM filter 3 extremes detector minimum register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFFFF00</resetValue>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>EXMINCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXMIN</name>
              <description>EXMIN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT3CNVTIMR</name>
          <displayName>DFSDM_FLT3CNVTIMR</displayName>
          <description>DFSDM filter 3 conversion timer register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>CNVCNT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT4CR1</name>
          <displayName>DFSDM_FLT4CR1</displayName>
          <description>DFSDM filter 4 control register 1</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFEN</name>
              <description>DFEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>JSWSTART</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSYNC</name>
              <description>JSYNC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSCAN</name>
              <description>JSCAN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JDMAEN</name>
              <description>JDMAEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>JEXTSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>JEXTEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RSWSTART</name>
              <description>RSWSTART</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCONT</name>
              <description>RCONT</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSYNC</name>
              <description>RSYNC</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDMAEN</name>
              <description>RDMAEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCH</name>
              <description>RCH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FAST</name>
              <description>FAST</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWFSEL</name>
              <description>AWFSEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT4CR2</name>
          <displayName>DFSDM_FLT4CR2</displayName>
          <description>DFSDM filter 4 control register 2</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JEOCIE</name>
              <description>JEOCIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCIE</name>
              <description>REOCIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRIE</name>
              <description>JOVRIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRIE</name>
              <description>ROVRIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDIE</name>
              <description>AWDIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCDIE</name>
              <description>SCDIE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABIE</name>
              <description>CKABIE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXCH</name>
              <description>EXCH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWDCH</name>
              <description>AWDCH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT4ISR</name>
          <displayName>DFSDM_FLT4ISR</displayName>
          <description>DFSDM filter 4 interrupt and status register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00FF0000</resetValue>
          <fields>
            <field>
              <name>JEOCF</name>
              <description>JEOCF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCF</name>
              <description>REOCF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRF</name>
              <description>JOVRF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRF</name>
              <description>ROVRF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDF</name>
              <description>AWDF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JCIP</name>
              <description>JCIP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCIP</name>
              <description>RCIP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABF</name>
              <description>CKABF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCDF</name>
              <description>SCDF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT4ICR</name>
          <displayName>DFSDM_FLT4ICR</displayName>
          <description>DFSDM filter 4 interrupt flag clear register</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRJOVRF</name>
              <description>CLRJOVRF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRROVRF</name>
              <description>CLRROVRF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRCKABF</name>
              <description>CLRCKABF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRSCDF</name>
              <description>CLRSCDF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT4JCHGR</name>
          <displayName>DFSDM_FLT4JCHGR</displayName>
          <description>DFSDM filter 4 injected channel group selection register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>JCHG</name>
              <description>JCHG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
