knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DTS</name>
      <description>DTS register block</description>
      <groupName>DTS</groupName>
	  <disableCondition>RCC->RCC_MC_APB3ENSETR->DTSEN == 0</disableCondition>
      <baseAddress>0x50028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
	  <interrupt>
        <name>DTS</name>
        <description>Digital temperature sensor interrupt</description>
        <value>147</value>
      </interrupt>
      <registers>
        <register>
          <name>DTS_CFGR1</name>
          <displayName>DTS_CFGR1</displayName>
          <description>DTS_CFGR1 is the configuration register for temperature sensor 1.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_EN</name>
              <description>TS1_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_START</name>
              <description>TS1_START</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_INTRIG_SEL</name>
              <description>TS1_INTRIG_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TS1_SMP_TIME</name>
              <description>TS1_SMP_TIME</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REFCLK_SEL</name>
              <description>REFCLK_SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q_MEAS_opt</name>
              <description>Q_MEAS_opt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSREF_CLK_DIV</name>
              <description>HSREF_CLK_DIV</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_T0VALR1</name>
          <displayName>DTS_T0VALR1</displayName>
          <description>DTS_T0VALR1 contains the value of the factory calibration temperature (T0) for temperature sensor 1. The system reset value is factory trimmed.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_FMT0</name>
              <description>TS1_FMT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TS1_T0</name>
              <description>TS1_T0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_RAMPVALR</name>
          <displayName>DTS_RAMPVALR</displayName>
          <description>The DTS_RAMPVALR is the ramp coefficient for the temperature sensor. The system reset value is factory trimmed.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_RAMP_COEFF</name>
              <description>TS1_RAMP_COEFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_ITR1</name>
          <displayName>DTS_ITR1</displayName>
          <description>DTS_ITR1 contains the threshold values for sensor 1.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_LITTHD</name>
              <description>TS1_LITTHD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TS1_HITTHD</name>
              <description>TS1_HITTHD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_DR</name>
          <displayName>DTS_DR</displayName>
          <description>The DTS_DR contains the number of REF_CLK cycles used to compute the FM(T) frequency.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_MFREQ</name>
              <description>TS1_MFREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_SR</name>
          <displayName>DTS_SR</displayName>
          <description>Temperature sensor status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_ITEF</name>
              <description>TS1_ITEF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITLF</name>
              <description>TS1_ITLF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITHF</name>
              <description>TS1_ITHF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITEF</name>
              <description>TS1_AITEF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITLF</name>
              <description>TS1_AITLF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITHF</name>
              <description>TS1_AITHF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_RDY</name>
              <description>TS1_RDY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_ITENR</name>
          <displayName>DTS_ITENR</displayName>
          <description>Temperature sensor interrupt enable register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_ITEEN</name>
              <description>TS1_ITEEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITLEN</name>
              <description>TS1_ITLEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITHEN</name>
              <description>TS1_ITHEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITEEN</name>
              <description>TS1_AITEEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITLEN</name>
              <description>TS1_AITLEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITHEN</name>
              <description>TS1_AITHEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_ICIFR</name>
          <displayName>DTS_ICIFR</displayName>
          <description>DTS_ICIFR is the control register for the interrupt flags.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS1_CITEF</name>
              <description>TS1_CITEF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CITLF</name>
              <description>TS1_CITLF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CITHF</name>
              <description>TS1_CITHF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITEF</name>
              <description>TS1_CAITEF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITLF</name>
              <description>TS1_CAITLF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITHF</name>
              <description>TS1_CAITHF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTS_OR</name>
          <displayName>DTS_OR</displayName>
          <description>The DTS_OR contains general-purpose option bits.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TS_Op0</name>
              <description>TS_Op0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op1</name>
              <description>TS_Op1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op2</name>
              <description>TS_Op2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op3</name>
              <description>TS_Op3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op4</name>
              <description>TS_Op4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op5</name>
              <description>TS_Op5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op6</name>
              <description>TS_Op6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op7</name>
              <description>TS_Op7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op8</name>
              <description>TS_Op8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op9</name>
              <description>TS_Op9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op10</name>
              <description>TS_Op10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op11</name>
              <description>TS_Op11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op12</name>
              <description>TS_Op12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op13</name>
              <description>TS_Op13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op14</name>
              <description>TS_Op14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op15</name>
              <description>TS_Op15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op16</name>
              <description>TS_Op16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op17</name>
              <description>TS_Op17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op18</name>
              <description>TS_Op18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op19</name>
              <description>TS_Op19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op20</name>
              <description>TS_Op20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op21</name>
              <description>TS_Op21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op22</name>
              <description>TS_Op22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op23</name>
              <description>TS_Op23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op24</name>
              <description>TS_Op24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op25</name>
              <description>TS_Op25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op26</name>
              <description>TS_Op26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op27</name>
              <description>TS_Op27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op28</name>
              <description>TS_Op28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op29</name>
              <description>TS_Op29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op30</name>
              <description>TS_Op30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_Op31</name>
              <description>TS_Op31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
