knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETH_DMA</name>
      <description>ETH_DMA</description>
      <groupName>Ethernet</groupName>
	  <disableCondition>RCC->RCC_MC_AHB6ENSETR->ETHCKEN == 0</disableCondition>
      <baseAddress>0x5800B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ETH_DMAMR</name>
          <displayName>ETH_DMAMR</displayName>
          <description>DMA mode register</description>
          <addressOffset>0x0000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAA</name>
              <description>TAA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TXPR</name>
              <description>Transmit priority</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PR</name>
              <description>Priority ratio</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>INTM</name>
              <description>Interrupt Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMASBMR</name>
          <displayName>ETH_DMASBMR</displayName>
          <description>System bus mode register</description>
          <addressOffset>0x0004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>FB</name>
              <description>Fixed Burst Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN4</name>
              <description>BLEN4</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN8</name>
              <description>BLEN8</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN16</name>
              <description>BLEN16</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN32</name>
              <description>BLEN32</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN64</name>
              <description>BLEN64</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN128</name>
              <description>BLEN128</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLEN256</name>
              <description>BLEN256</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AAL</name>
              <description>Address-Aligned Beats</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONEKBBE</name>
              <description>ONEKBBE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_OSR_LMT</name>
              <description>RD_OSR_LMT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WR_OSR_LMT</name>
              <description>WR_OSR_LMT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPI_XIT_PKT</name>
              <description>LPI_XIT_PKT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_LPI</name>
              <description>EN_LPI</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAISR</name>
          <displayName>ETH_DMAISR</displayName>
          <description>Interrupt status register</description>
          <addressOffset>0x0008</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>DC0IS</name>
              <description>DMA Channel Interrupt
              Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DC1IS</name>
              <description>DC1IS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTLIS</name>
              <description>MTL Interrupt Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MACIS</name>
              <description>MAC Interrupt Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMADSR</name>
          <displayName>ETH_DMADSR</displayName>
          <description>Debug status register</description>
          <addressOffset>0x000C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AXWHSTS</name>
              <description>AHB Master Write Channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXRHSTS</name>
              <description>AXRHSTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPS0</name>
              <description>RPS0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TPS0</name>
              <description>TPS0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RPS1</name>
              <description>RPS1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TPS1</name>
              <description>TPS1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAA4TxACR</name>
          <displayName>ETH_DMAA4TxACR</displayName>
          <description>AXI4 transmit channel ACE control
          register</description>
          <addressOffset>0x0020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDRC</name>
              <description>TDRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TEC</name>
              <description>TEC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>THC</name>
              <description>THC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAA4RxACR</name>
          <displayName>ETH_DMAA4RxACR</displayName>
          <description>AXI4 receive channel ACE control
          register</description>
          <addressOffset>0x0024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDWC</name>
              <description>RDWC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RPC</name>
              <description>RPC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RHC</name>
              <description>RHC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDC</name>
              <description>RDC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAA4DACR</name>
          <displayName>ETH_DMAA4DACR</displayName>
          <description>AXI4 descriptor ACE control
          register</description>
          <addressOffset>0x0028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDWC</name>
              <description>TDWC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TDWD</name>
              <description>TDWD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RDRC</name>
              <description>RDRC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>RDP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WRP</name>
              <description>WRP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0CR</name>
          <displayName>ETH_DMAC0CR</displayName>
          <description>Channel 0 control register</description>
          <addressOffset>0x0100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSS</name>
              <description>MSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>PBLX8</name>
              <description>PBLX8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSL</name>
              <description>DSL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC1CR</name>
          <displayName>ETH_DMAC1CR</displayName>
          <description>Channel 1 control register</description>
          <addressOffset>0x0180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSS</name>
              <description>MSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>PBLX8</name>
              <description>PBLX8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSL</name>
              <description>DSL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0TxCR</name>
          <displayName>ETH_DMAC0TxCR</displayName>
          <description>Channel 0 transmit control
          register</description>
          <addressOffset>0x0104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST</name>
              <description>ST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCW</name>
              <description>TCW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OSF</name>
              <description>OSF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXPBL</name>
              <description>TXPBL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TQOS</name>
              <description>TQOS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC1TxCR</name>
          <displayName>ETH_DMAC1TxCR</displayName>
          <description>Channel 1 transmit control
          register</description>
          <addressOffset>0x0184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST</name>
              <description>ST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCW</name>
              <description>TCW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OSF</name>
              <description>OSF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXPBL</name>
              <description>TXPBL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TQOS</name>
              <description>TQOS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0RxCR</name>
          <displayName>ETH_DMAC0RxCR</displayName>
          <description>Channel receive control
          register</description>
          <addressOffset>0x0108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>SR</name>
              <description>Start or Stop Receive
              Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBSZ</name>
              <description>Receive Buffer size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>RXPBL</name>
              <description>RXPBL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RQOS</name>
              <description>RQOS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RPF</name>
              <description>DMA Rx Channel Packet
              Flush</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0TxDLAR</name>
          <displayName>ETH_DMAC0TxDLAR</displayName>
          <description>Channel i Tx descriptor list address
          register</description>
          <addressOffset>0x0114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDESLA</name>
              <description>Start of Transmit List</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC1TxDLAR</name>
          <displayName>ETH_DMAC1TxDLAR</displayName>
          <description>Channel i Tx descriptor list address
          register</description>
          <addressOffset>0x0194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDESLA</name>
              <description>Start of Transmit List</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0RxDLAR</name>
          <displayName>ETH_DMAC0RxDLAR</displayName>
          <description>Channel Rx descriptor list address
          register</description>
          <addressOffset>0x011C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>RDESLA</name>
              <description>Start of Receive List</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0TxDTPR</name>
          <displayName>ETH_DMAC0TxDTPR</displayName>
          <description>Channel Tx descriptor tail pointer
          register</description>
          <addressOffset>0x0120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDT</name>
              <description>Transmit Descriptor Tail
              Pointer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC1TxDTPR</name>
          <displayName>ETH_DMAC1TxDTPR</displayName>
          <description>Channel Tx descriptor tail pointer
          register</description>
          <addressOffset>0x01A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDT</name>
              <description>Transmit Descriptor Tail
              Pointer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0RxDTPR</name>
          <displayName>ETH_DMAC0RxDTPR</displayName>
          <description>Channel Rx descriptor tail pointer
          register</description>
          <addressOffset>0x0128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>RDT</name>
              <description>Receive Descriptor Tail
              Pointer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0TxRLR</name>
          <displayName>ETH_DMAC0TxRLR</displayName>
          <description>Channel Tx descriptor ring length
          register</description>
          <addressOffset>0x012C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDRL</name>
              <description>Transmit Descriptor Ring
              Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC1TxRLR</name>
          <displayName>ETH_DMAC1TxRLR</displayName>
          <description>Channel Tx descriptor ring length
          register</description>
          <addressOffset>0x01AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <fields>
            <field>
              <name>TDRL</name>
              <description>Transmit Descriptor Ring
              Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_DMAC0RxRLR</name>
          <displayName>ETH_DMAC0RxRLR</displayName>
          <description>Channel Rx descriptor ring length
          register</description>
          <addressOffset>0x0130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>RDRL</name>
              <description>Receive Descriptor Ring
              Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
