knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
        <register>
          <name>FMC_HWCFGR2</name>
          <displayName>FMC_HWCFGR2</displayName>
          <description>FMC Hardware configuration register 2</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00DC8762</resetValue>
          <fields>
            <field>
              <name>RD_LN2DPTH</name>
              <description>RD_LN2DPTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NOR_BASE</name>
              <description>NOR_BASE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM_RBASE</name>
              <description>SDRAM_RBASE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NAND_BASE</name>
              <description>NAND_BASE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM1_BASE</name>
              <description>SDRAM1_BASE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM2_BASE</name>
              <description>SDRAM2_BASE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_HWCFGR1</name>
          <displayName>FMC_HWCFGR1</displayName>
          <description>FMC Hardware configuration register 1</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x2232B011</resetValue>
          <fields>
            <field>
              <name>NAND_SEL</name>
              <description>NAND_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAND_ECC</name>
              <description>NAND_ECC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDRAM_SEL</name>
              <description>SDRAM_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID_SIZE</name>
              <description>ID_SIZE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WA_LN2DPTH</name>
              <description>WA_LN2DPTH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WD_LN2DPTH</name>
              <description>WD_LN2DPTH</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WR_LN2DPTH</name>
              <description>WR_LN2DPTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RA_LN2DPTH</name>
              <description>RA_LN2DPTH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_VERR</name>
          <displayName>FMC_VERR</displayName>
          <description>FMC Version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_IPIDR</name>
          <displayName>FMC_IPIDR</displayName>
          <description>FMC Identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00140001</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_SIDR</name>
          <displayName>FMC_SIDR</displayName>
          <description>FMC Size Identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	<peripheral>
      <name>GICC</name>
      <description>GICC</description>
      <groupName>GICC</groupName>
      <baseAddress>0xA0022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GICC_CTLR</name>
          <displayName>GICC_CTLR</displayName>
          <description>GICC control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEGRP0</name>
              <description>ENABLEGRP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLEGRP1</name>
              <description>ENABLEGRP1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKCTL</name>
              <description>ACKCTL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIQEN</name>
              <description>FIQEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBPR</name>
              <description>CBPR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIQBYPDISGRP0</name>
              <description>FIQBYPDISGRP0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQBYPDISGRP0</name>
              <description>IRQBYPDISGRP0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIQBYPDISGRP1</name>
              <description>FIQBYPDISGRP1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQBYPDISGRP1</name>
              <description>IRQBYPDISGRP1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIMODES</name>
              <description>EOIMODES</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIMODENS</name>
              <description>EOIMODENS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_PMR</name>
          <displayName>GICC_PMR</displayName>
          <description>GICC input priority mask register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_BPR</name>
          <displayName>GICC_BPR</displayName>
          <description>GICC binary point register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>BINARY_POINT</name>
              <description>BINARY_POINT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_IAR</name>
          <displayName>GICC_IAR</displayName>
          <description>GICC interrupt acknowledge register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_EOIR</name>
          <displayName>GICC_EOIR</displayName>
          <description>GICC end of interrupt register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOIINTID</name>
              <description>EOIINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_RPR</name>
          <displayName>GICC_RPR</displayName>
          <description>GICC running priority register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_HPPIR</name>
          <displayName>GICC_HPPIR</displayName>
          <description>GICC highest priority pending interrupt register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>PENDINTID</name>
              <description>PENDINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_ABPR</name>
          <displayName>GICC_ABPR</displayName>
          <description>GICC_ABPR is an alias of the non-secure GICC_BPR. When GICC_CTLR.CBPR is set to 0, a secure access to this register is equivalent to a non-secure access to GICC_BPR.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BINARY_POINT</name>
              <description>BINARY_POINT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_AIAR</name>
          <displayName>GICC_AIAR</displayName>
          <description>GICC_AIAR is an alias of the non-secure view of GICC_IAR. A secure access to this register is identical to a non-secure access to GICC_IAR.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_AEOIR</name>
          <displayName>GICC_AEOIR</displayName>
          <description>GICC_AEOIR is an alias of the Non-secure GICC_EOIR. A secure access to this register is similar to a non-secure access to GICC_EOIR, except that the GICC_CTLR.EOImodeS bit is used.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOIINTID</name>
              <description>EOIINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_AHPPIR</name>
          <displayName>GICC_AHPPIR</displayName>
          <description>ICC_AHPPIR is an alias of the non-secure GICC_HPPIR. A secure access to this register is equivalent to a non-secure access to GICC_HPPIR.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>PENDINTID</name>
              <description>PENDINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_APR0</name>
          <displayName>GICC_APR0</displayName>
          <description>GICC active priority register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APR0</name>
              <description>APR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_NSAPR0</name>
          <displayName>GICC_NSAPR0</displayName>
          <description>GICC non-secure active priority register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAPR0</name>
              <description>NSAPR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_IIDR</name>
          <displayName>GICC_IIDR</displayName>
          <description>GICC interface identification register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0102143B</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ARCH</name>
              <description>ARCH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRODUCTID</name>
              <description>PRODUCTID</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICC_DIR</name>
          <displayName>GICC_DIR</displayName>
          <description>GICC deactivate interrupt register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
