knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GICD</name>
      <description>GICD</description>
      <groupName>GICD</groupName>
      <baseAddress>0xA0021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GICD_CTLR</name>
          <displayName>GICD_CTLR</displayName>
          <description>GICD control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEGRP0</name>
              <description>ENABLEGRP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLEGRP1</name>
              <description>ENABLEGRP1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_TYPER</name>
          <displayName>GICD_TYPER</displayName>
          <description>GICD interrupt controller type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000FC28</resetValue>
          <fields>
            <field>
              <name>ITLINESNUMBER</name>
              <description>ITLINESNUMBER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CPUNUMBER</name>
              <description>CPUNUMBER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SECURITYEXTN</name>
              <description>SECURITYEXTN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSPI</name>
              <description>LSPI</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IIDR</name>
          <displayName>GICD_IIDR</displayName>
          <description>GICD implementer identification register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0100143B</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>VARIANT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRODUCTID</name>
              <description>PRODUCTID</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR0</name>
          <displayName>GICD_IGROUPR0</displayName>
          <description>For interrupts ID</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR0</name>
              <description>IGROUPR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR1</name>
          <displayName>GICD_IGROUPR1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR1</name>
              <description>IGROUPR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR2</name>
          <displayName>GICD_IGROUPR2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR2</name>
              <description>IGROUPR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR3</name>
          <displayName>GICD_IGROUPR3</displayName>
          <description>For interrupts ID = x*32 to ID = x*32+31</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR3</name>
              <description>IGROUPR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR4</name>
          <displayName>GICD_IGROUPR4</displayName>
          <description>For interrupts ID = x*32 to ID = x*32+31</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR4</name>
              <description>IGROUPR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR5</name>
          <displayName>GICD_IGROUPR5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR5</name>
              <description>IGROUPR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR6</name>
          <displayName>GICD_IGROUPR6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR6</name>
              <description>IGROUPR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR7</name>
          <displayName>GICD_IGROUPR7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR7</name>
              <description>IGROUPR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR8</name>
          <displayName>GICD_IGROUPR8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR8</name>
              <description>IGROUPR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER0</name>
          <displayName>GICD_ISENABLER0</displayName>
          <description>For interrupts ID = 0 to ID = 31</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ISENABLER0</name>
              <description>ISENABLER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER1</name>
          <displayName>GICD_ISENABLER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER1</name>
              <description>ISENABLER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER2</name>
          <displayName>GICD_ISENABLER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER2</name>
              <description>ISENABLER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER3</name>
          <displayName>GICD_ISENABLER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER3</name>
              <description>ISENABLER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER4</name>
          <displayName>GICD_ISENABLER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER4</name>
              <description>ISENABLER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER5</name>
          <displayName>GICD_ISENABLER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER5</name>
              <description>ISENABLER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER6</name>
          <displayName>GICD_ISENABLER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER6</name>
              <description>ISENABLER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER7</name>
          <displayName>GICD_ISENABLER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER7</name>
              <description>ISENABLER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER8</name>
          <displayName>GICD_ISENABLER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER8</name>
              <description>ISENABLER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER0</name>
          <displayName>GICD_ICENABLER0</displayName>
          <description>For interrupts ID = 0 to ID = 31</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ICENABLER0</name>
              <description>ICENABLER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER1</name>
          <displayName>GICD_ICENABLER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER1</name>
              <description>ICENABLER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER2</name>
          <displayName>GICD_ICENABLER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER2</name>
              <description>ICENABLER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER3</name>
          <displayName>GICD_ICENABLER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER3</name>
              <description>ICENABLER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER4</name>
          <displayName>GICD_ICENABLER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER4</name>
              <description>ICENABLER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER5</name>
          <displayName>GICD_ICENABLER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER5</name>
              <description>ICENABLER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER6</name>
          <displayName>GICD_ICENABLER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER6</name>
              <description>ICENABLER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER7</name>
          <displayName>GICD_ICENABLER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER7</name>
              <description>ICENABLER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER8</name>
          <displayName>GICD_ICENABLER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER8</name>
              <description>ICENABLER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR0</name>
          <displayName>GICD_ISPENDR0</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR0</name>
              <description>ISPENDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR1</name>
          <displayName>GICD_ISPENDR1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR1</name>
              <description>ISPENDR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR2</name>
          <displayName>GICD_ISPENDR2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR2</name>
              <description>ISPENDR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR3</name>
          <displayName>GICD_ISPENDR3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR3</name>
              <description>ISPENDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR4</name>
          <displayName>GICD_ISPENDR4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR4</name>
              <description>ISPENDR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR5</name>
          <displayName>GICD_ISPENDR5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR5</name>
              <description>ISPENDR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR6</name>
          <displayName>GICD_ISPENDR6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR6</name>
              <description>ISPENDR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
