knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
        <register>
          <name>I2C_IPIDR</name>
          <displayName>I2C_IPIDR</displayName>
          <description>I2C identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00130012</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SIDR</name>
          <displayName>I2C_SIDR</displayName>
          <description>I2C size identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
	  <disableCondition>RCC->RCC_MC_APB1ENSETR->I2C2EN == 0</disableCondition>
      <baseAddress>0x40013000</baseAddress>
      <interrupt>
        <name>I2C2_EVT</name>
        <description>I2C2 event interrupt</description>
        <value>33</value>
      </interrupt>
	  <interrupt>
        <name>I2C2_ERR</name>
        <description>I2C2 global error interrupt</description>
        <value>34</value>
      </interrupt>	  
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
	  <disableCondition>RCC->RCC_MC_APB1ENSETR->I2C3EN == 0</disableCondition>
      <baseAddress>0x40014000</baseAddress>
	  <interrupt>
        <name>I2C3_EVT</name>
        <description>I2C3 event interrupt</description>
        <value>72</value>
      </interrupt>
	  <interrupt>
        <name>I2C3_ERR</name>
        <description>I2C3 global error interrupt</description>
        <value>73</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
	  <disableCondition>RCC->RCC_MC_APB5ENSETR->I2C4EN == 0</disableCondition>
      <baseAddress>0x5C002000</baseAddress>
	  <interrupt>
        <name>I2C4_EVT</name>
        <description>I2C4 event interrupt</description>
        <value>95</value>
      </interrupt>
	  <interrupt>
        <name>I2C4_ERR</name>
        <description>I2C4 global error interrupt</description>
        <value>96</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C5</name>
	  <disableCondition>RCC->RCC_MC_APB1ENSETR->I2C5EN == 0</disableCondition>
      <baseAddress>0x40015000</baseAddress>
	  <interrupt>
        <name>I2C5_EVT</name>
        <description>I2C5 event interrupt</description>
        <value>107</value>
      </interrupt>
	  <interrupt>
        <name>I2C5_ERR</name>
        <description>I2C5 global error interrupt</description>
        <value>108</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C6</name>
	  <disableCondition>RCC->RCC_MC_APB5ENSETR->I2C6EN == 0</disableCondition>
      <baseAddress>0x5C009000</baseAddress>
	  <interrupt>
        <name>I2C6_EVT</name>
        <description>I2C6 event interrupt</description>
        <value>135</value>
      </interrupt>
	  <interrupt>
        <name>I2C6_ERR</name>
        <description>I2C6 global error interrupt</description>
        <value>136</value>
      </interrupt>
    </peripheral>
	<peripheral>
			<name>IPCC</name>
			<description>IPCC</description>
			<groupName>IPCC</groupName>
			<disableCondition>RCC->RCC_MC_AHB3ENSETR->IPCCEN == 0</disableCondition>
			<baseAddress>0x4C001000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
               <name>IPCC_RX0</name>
               <description>IPCC RX0 occupied interrupt</description>
               <value>100</value>
            </interrupt>
			<interrupt>
               <name>IPCC_TX0</name>
               <description>IPCC TX0 free interrupt</description>
               <value>101</value>
            </interrupt>
			<interrupt>
               <name>IPCC_RX1</name>
               <description>IPCC RX1 occupied interrupt</description>
               <value>103</value>
            </interrupt>
			<interrupt>
               <name>IPCC_TX1</name>
               <description>IPCC TX1 free interrupt</description>
               <value>104</value>
            </interrupt>
			<registers>
				<register>
					<name>IPCC_C1CR</name>
					<displayName>IPCC_C1CR</displayName>
					<description>IPCC Processor 1 control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RXOIE</name>
							<description>RXOIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIE</name>
							<description>TXFIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1MR</name>
					<displayName>IPCC_C1MR</displayName>
					<description>IPCC Processor 1 mask register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>CHxOM</name>
							<description>CHxOM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxFM</name>
							<description>CHxFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1SCR</name>
					<displayName>IPCC_C1SCR</displayName>
					<description>Reading this register will always return 0x0000 0000.</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxC</name>
							<description>CHxC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxS</name>
							<description>CHxS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1TOC2SR</name>
					<displayName>IPCC_C1TOC2SR</displayName>
					<description>IPCC processor 1 to processor 2 status register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxF</name>
							<description>CHxF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2CR</name>
					<displayName>IPCC_C2CR</displayName>
					<description>IPCC Processor 2 control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RXOIE</name>
							<description>RXOIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIE</name>
							<description>TXFIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2MR</name>
					<displayName>IPCC_C2MR</displayName>
					<description>IPCC Processor 2 mask register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>CHxOM</name>
							<description>CHxOM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxFM</name>
							<description>CHxFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2SCR</name>
					<displayName>IPCC_C2SCR</displayName>
					<description>Reading this register will always return 0x0000 0000.</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxC</name>
							<description>CHxC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxS</name>
							<description>CHxS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2TOC1SR</name>
					<displayName>IPCC_C2TOC1SR</displayName>
					<description>IPCC processor 2 to processor 1 status register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxF</name>
							<description>CHxF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_HWCFGR</name>
					<displayName>IPCC_HWCFGR</displayName>
					<description>IPCC Hardware configuration register</description>
					<addressOffset>0x3F0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000002</resetValue>
					<fields>
						<field>
							<name>CHANNELS</name>
							<description>CHANNELS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_VER</name>
					<displayName>IPCC_VER</displayName>
					<description>IPCC IP Version register</description>
					<addressOffset>0x3F4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000010</resetValue>
					<fields>
						<field>
							<name>MINREV</name>
							<description>MINREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MAJREV</name>
							<description>MAJREV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_ID</name>
					<displayName>IPCC_ID</displayName>
					<description>IPCC IP Identification register</description>
					<addressOffset>0x3F8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00100071</resetValue>
					<fields>
						<field>
							<name>IPID</name>
							<description>IPID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_SID</name>
					<displayName>IPCC_SID</displayName>
					<description>IPCC Size ID register</description>
					<addressOffset>0x3FC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0xA3C5DD01</resetValue>
					<fields>
						<field>
							<name>SID</name>
							<description>SID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
