knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>OTG_GRXSTSR</name>
					<displayName>OTG_GRXSTSR</displayName>
					<description>This description is for register OTG_GRXSTSR in Device mode. A read to the receive status debug read register returns the contents of the top of the receive FIFO. The core ignores the receive status read when the receive FIFO is empty and returns a value of 0x00000000.</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EPNUM</name>
							<description>EPNUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BCNT</name>
							<description>BCNT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>DPID</name>
							<description>DPID</description>
							<bitOffset>15</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PKTSTS</name>
							<description>PKTSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FRMNUM</name>
							<description>FRMNUM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>STSPHST</name>
							<description>STSPHST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_GRXSTSP</name>
					<displayName>OTG_GRXSTSP</displayName>
					<description>This description is for register OTG_GRXSTSP in Device mode. Similarly to OTG_GRXSTSR (receive status debug read register) where a read returns the contents of the top of the receive FIFO, a read to OTG_GRXSTSP (receive status read and pop register) additionally pops the top data entry out of the Rx FIFO. The core ignores the receive status pop/read when the receive FIFO is empty and returns a value of 0x00000000. The application must only pop the receive status FIFO when the receive FIFO non-empty bit of the core interrupt register (RXFLVL bit in OTG_GINTSTS) is asserted.</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EPNUM</name>
							<description>EPNUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BCNT</name>
							<description>BCNT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>DPID</name>
							<description>DPID</description>
							<bitOffset>15</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PKTSTS</name>
							<description>PKTSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FRMNUM</name>
							<description>FRMNUM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>STSPHST</name>
							<description>STSPHST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_GRXFSIZ</name>
					<displayName>OTG_GRXFSIZ</displayName>
					<description>The application can program the RAM size that must be allocated to the Rx FIFO.</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>RXFD</name>
							<description>RXFD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HNPTXFSIZ</name>
					<displayName>OTG_HNPTXFSIZ</displayName>
					<description>Host mode</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000200</resetValue>
					<fields>
						<field>
							<name>NPTXFSA</name>
							<description>NPTXFSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>NPTXFD</name>
							<description>NPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HNPTXSTS</name>
					<displayName>OTG_HNPTXSTS</displayName>
					<description>In device mode, this register is not valid. This read-only register contains the free space information for the non-periodic Tx FIFO and the non-periodic transmit request queue.</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00080400</resetValue>
					<fields>
						<field>
							<name>NPTXFSAV</name>
							<description>NPTXFSAV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>NPTQXSAV</name>
							<description>NPTQXSAV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>NPTXQTOP</name>
							<description>NPTXQTOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_GCCFG</name>
					<displayName>OTG_GCCFG</displayName>
					<description>OTG general core configuration register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PDET</name>
							<description>PDET</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDET</name>
							<description>SDET</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PS2DET</name>
							<description>PS2DET</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRDWN</name>
							<description>PWRDWN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BCDEN</name>
							<description>BCDEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PDEN</name>
							<description>PDEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDEN</name>
							<description>SDEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VBDEN</name>
							<description>VBDEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDEN</name>
							<description>IDEN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_CID</name>
					<displayName>OTG_CID</displayName>
					<description>This is a register containing the Product ID as reset value.</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00004000</resetValue>
					<fields>
						<field>
							<name>PRODUCT_ID</name>
							<description>PRODUCT_ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_GLPMCFG</name>
					<displayName>OTG_GLPMCFG</displayName>
					<description>OTG core LPM configuration register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPMEN</name>
							<description>LPMEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPMACK</name>
							<description>LPMACK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BESL</name>
							<description>BESL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REMWAKE</name>
							<description>REMWAKE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>L1SSEN</name>
							<description>L1SSEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BESLTHRS</name>
							<description>BESLTHRS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>L1DSEN</name>
							<description>L1DSEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPMRSP</name>
							<description>LPMRSP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SLPSTS</name>
							<description>SLPSTS</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>L1RSMOK</name>
							<description>L1RSMOK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LPMCHIDX</name>
							<description>LPMCHIDX</description>
							<bitOffset>17</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPMRCNT</name>
							<description>LPMRCNT</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SNDLPM</name>
							<description>SNDLPM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPMRCNTSTS</name>
							<description>LPMRCNTSTS</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENBESL</name>
							<description>ENBESL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HPTXFSIZ</name>
					<displayName>OTG_HPTXFSIZ</displayName>
					<description>OTG host periodic transmit FIFO size register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>PTXSA</name>
							<description>PTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>PTXFSIZ</name>
							<description>PTXFSIZ</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF1</name>
					<displayName>OTG_DIEPTXF1</displayName>
					<description>OTG device IN endpoint transmit FIFO 1 size register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF2</name>
					<displayName>OTG_DIEPTXF2</displayName>
					<description>OTG device IN endpoint transmit FIFO 2 size register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF3</name>
					<displayName>OTG_DIEPTXF3</displayName>
					<description>OTG device IN endpoint transmit FIFO 3 size register</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF4</name>
					<displayName>OTG_DIEPTXF4</displayName>
					<description>OTG device IN endpoint transmit FIFO 4 size register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF5</name>
					<displayName>OTG_DIEPTXF5</displayName>
					<description>OTG device IN endpoint transmit FIFO 5 size register</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF6</name>
					<displayName>OTG_DIEPTXF6</displayName>
					<description>OTG device IN endpoint transmit FIFO 6 size register</description>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF7</name>
					<displayName>OTG_DIEPTXF7</displayName>
					<description>OTG device IN endpoint transmit FIFO 7 size register</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTXF8</name>
					<displayName>OTG_DIEPTXF8</displayName>
					<description>OTG device IN endpoint transmit FIFO 8 size register</description>
					<addressOffset>0x120</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02000400</resetValue>
					<fields>
						<field>
							<name>INEPTXSA</name>
							<description>INEPTXSA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INEPTXFD</name>
							<description>INEPTXFD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCFG</name>
					<displayName>OTG_HCFG</displayName>
					<description>This register configures the core after power-on. Do not make changes to this register after initializing the host.</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FSLSPCS</name>
							<description>FSLSPCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSLSS</name>
							<description>FSLSS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DESCDMA</name>
							<description>DESCDMA</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FRLSTEN</name>
							<description>FRLSTEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PERSSCHEDENA</name>
							<description>PERSSCHEDENA</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HFIR</name>
					<displayName>OTG_HFIR</displayName>
					<description>This register stores the frame interval information for the current speed to which the OTG controller has enumerated.</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000EA60</resetValue>
					<fields>
						<field>
							<name>FRIVL</name>
							<description>FRIVL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>RLDCTRL</name>
							<description>RLDCTRL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HFNUM</name>
					<displayName>OTG_HFNUM</displayName>
					<description>This register indicates the current frame number. It also indicates the time remaining (in terms of the number of PHY clocks) in the current frame.</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00003FFF</resetValue>
					<fields>
						<field>
							<name>FRNUM</name>
							<description>FRNUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>FTREM</name>
							<description>FTREM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HPTXSTS</name>
					<displayName>OTG_HPTXSTS</displayName>
					<description>This read-only register contains the free space information for the periodic Tx FIFO and the periodic transmit request queue.</description>
					<addressOffset>0x410</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00080100</resetValue>
					<fields>
						<field>
							<name>PTXFSAVL</name>
							<description>PTXFSAVL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>PTXQSAV</name>
							<description>PTXQSAV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>PTXQTOP</name>
							<description>PTXQTOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HAINT</name>
					<displayName>OTG_HAINT</displayName>
					<description>When a significant event occurs on a channel, the host all channels interrupt register interrupts the application using the host channels interrupt bit of the core interrupt register (HCINT bit in OTG_GINTSTS). This is shown in Figure724. There is one interrupt bit per channel, up to a maximum of 16 bits. Bits in this register are set and cleared when the application sets and clears bits in the corresponding host channel-x interrupt register.</description>
					<addressOffset>0x414</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HAINT</name>
							<description>HAINT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HAINTMSK</name>
					<displayName>OTG_HAINTMSK</displayName>
					<description>The host all channel interrupt mask register works with the host all channel interrupt register to interrupt the application when an event occurs on a channel. There is one interrupt mask bit per channel, up to a maximum of 16 bits.</description>
					<addressOffset>0x418</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HAINTM</name>
							<description>HAINTM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HFLBADDR</name>
					<displayName>OTG_HFLBADDR</displayName>
					<description>This register holds the starting address of the frame list information (scatter/gather mode).</description>
					<addressOffset>0x41C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HFLBADDR</name>
							<description>HFLBADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
