knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>OTG_DIEPCTL5</name>
					<displayName>OTG_DIEPCTL5</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0x9A0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFNUM</name>
							<description>TXFNUM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SODDFRM</name>
							<description>SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPINT5</name>
					<displayName>OTG_DIEPINT5</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the IN endpoints interrupt bit of the core interrupt register (IEPINT in OTG_GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (OTG_DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0x9A8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOC</name>
							<description>TOC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ITTXFE</name>
							<description>ITTXFE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNM</name>
							<description>INEPNM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNE</name>
							<description>INEPNE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFE</name>
							<description>TXFE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFIFOUDRN</name>
							<description>TXFIFOUDRN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PKTDRPSTS</name>
							<description>PKTDRPSTS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTSIZ5</name>
					<displayName>OTG_DIEPTSIZ5</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using the endpoint enable bit in the OTG_DIEPCTLx registers (EPENA bit in OTG_DIEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0x9B0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>MCNT</name>
							<description>MCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPDMA5</name>
					<displayName>OTG_DIEPDMA5</displayName>
					<description>OTG device IN endpoint 5 DMA address register</description>
					<addressOffset>0x9B4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DTXFSTS5</name>
					<displayName>OTG_DTXFSTS5</displayName>
					<description>This read-only register contains the free space information for the device IN endpoint Tx FIFO.</description>
					<addressOffset>0x9B8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000200</resetValue>
					<fields>
						<field>
							<name>INEPTFSAV</name>
							<description>INEPTFSAV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPCTL6</name>
					<displayName>OTG_DIEPCTL6</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0x9C0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFNUM</name>
							<description>TXFNUM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SODDFRM</name>
							<description>SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPINT6</name>
					<displayName>OTG_DIEPINT6</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the IN endpoints interrupt bit of the core interrupt register (IEPINT in OTG_GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (OTG_DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0x9C8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOC</name>
							<description>TOC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ITTXFE</name>
							<description>ITTXFE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNM</name>
							<description>INEPNM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNE</name>
							<description>INEPNE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFE</name>
							<description>TXFE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFIFOUDRN</name>
							<description>TXFIFOUDRN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PKTDRPSTS</name>
							<description>PKTDRPSTS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTSIZ6</name>
					<displayName>OTG_DIEPTSIZ6</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using the endpoint enable bit in the OTG_DIEPCTLx registers (EPENA bit in OTG_DIEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0x9D0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>MCNT</name>
							<description>MCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPDMA6</name>
					<displayName>OTG_DIEPDMA6</displayName>
					<description>OTG device IN endpoint 6 DMA address register</description>
					<addressOffset>0x9D4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DTXFSTS6</name>
					<displayName>OTG_DTXFSTS6</displayName>
					<description>This read-only register contains the free space information for the device IN endpoint Tx FIFO.</description>
					<addressOffset>0x9D8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000200</resetValue>
					<fields>
						<field>
							<name>INEPTFSAV</name>
							<description>INEPTFSAV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPCTL7</name>
					<displayName>OTG_DIEPCTL7</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0x9E0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFNUM</name>
							<description>TXFNUM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SODDFRM</name>
							<description>SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPINT7</name>
					<displayName>OTG_DIEPINT7</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the IN endpoints interrupt bit of the core interrupt register (IEPINT in OTG_GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (OTG_DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0x9E8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOC</name>
							<description>TOC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ITTXFE</name>
							<description>ITTXFE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNM</name>
							<description>INEPNM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNE</name>
							<description>INEPNE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFE</name>
							<description>TXFE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFIFOUDRN</name>
							<description>TXFIFOUDRN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PKTDRPSTS</name>
							<description>PKTDRPSTS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DIEPTSIZ7</name>
					<displayName>OTG_DIEPTSIZ7</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using the endpoint enable bit in the OTG_DIEPCTLx registers (EPENA bit in OTG_DIEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0x9F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>MCNT</name>
							<description>MCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
