knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>RCC_MP_AHB6ENSETR</name>
					<displayName>RCC_MP_AHB6ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit of the corresponding peripheral to . It shall be used to allocate a peripheral to the MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x218</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPUEN</name>
							<description>GPUEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKEN</name>
							<description>ETHCKEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXEN</name>
							<description>ETHTXEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXEN</name>
							<description>ETHRXEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACEN</name>
							<description>ETHMACEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCEN</name>
							<description>FMCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIEN</name>
							<description>QSPIEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1EN</name>
							<description>SDMMC1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2EN</name>
							<description>SDMMC2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1EN</name>
							<description>CRC1EN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHEN</name>
							<description>USBHEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_AHB6ENCLRR</name>
					<displayName>RCC_MP_AHB6ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit of the corresponding peripheral. It shall be used to deallocate a peripheral from MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x21C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPUEN</name>
							<description>GPUEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKEN</name>
							<description>ETHCKEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXEN</name>
							<description>ETHTXEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXEN</name>
							<description>ETHRXEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACEN</name>
							<description>ETHMACEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCEN</name>
							<description>FMCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIEN</name>
							<description>QSPIEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1EN</name>
							<description>SDMMC1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2EN</name>
							<description>SDMMC2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1EN</name>
							<description>CRC1EN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHEN</name>
							<description>USBHEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_TZAHB6ENSETR</name>
					<displayName>RCC_MP_TZAHB6ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit of the corresponding peripheral to . It shall be used to allocate a peripheral to the MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x220</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_TZAHB6ENCLRR</name>
					<displayName>RCC_MP_TZAHB6ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit of the corresponding peripheral. It shall be used to deallocate a peripheral from MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x224</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB4ENSETR</name>
					<displayName>RCC_MC_APB4ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0x280</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCEN</name>
							<description>LTDCEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIEN</name>
							<description>DSIEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMEN</name>
							<description>DDRPERFMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYEN</name>
							<description>USBPHYEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROEN</name>
							<description>STGENROEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB4ENCLRR</name>
					<displayName>RCC_MC_APB4ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0x284</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCEN</name>
							<description>LTDCEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIEN</name>
							<description>DSIEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMEN</name>
							<description>DDRPERFMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYEN</name>
							<description>USBPHYEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROEN</name>
							<description>STGENROEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB5ENSETR</name>
					<displayName>RCC_MC_APB5ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0x288</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6EN</name>
							<description>SPI6EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4EN</name>
							<description>I2C4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6EN</name>
							<description>I2C6EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTCAPBEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC1EN</name>
							<description>TZC1EN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC2EN</name>
							<description>TZC2EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZPCEN</name>
							<description>TZPCEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSECEN</name>
							<description>BSECEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENEN</name>
							<description>STGENEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB5ENCLRR</name>
					<displayName>RCC_MC_APB5ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0x28C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6EN</name>
							<description>SPI6EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4EN</name>
							<description>I2C4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6EN</name>
							<description>I2C6EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTCAPBEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC1EN</name>
							<description>TZC1EN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC2EN</name>
							<description>TZC2EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZPCEN</name>
							<description>TZPCEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSECEN</name>
							<description>BSECEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENEN</name>
							<description>STGENEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB5ENSETR</name>
					<displayName>RCC_MC_AHB5ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x290</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOZEN</name>
							<description>GPIOZEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1EN</name>
							<description>CRYP1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1EN</name>
							<description>HASH1EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1EN</name>
							<description>RNG1EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKPSRAMEN</name>
							<description>BKPSRAMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB5ENCLRR</name>
					<displayName>RCC_MC_AHB5ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x294</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOZEN</name>
							<description>GPIOZEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1EN</name>
							<description>CRYP1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1EN</name>
							<description>HASH1EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1EN</name>
							<description>RNG1EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKPSRAMEN</name>
							<description>BKPSRAMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB6ENSETR</name>
					<displayName>RCC_MC_AHB6ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0x298</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPUEN</name>
							<description>GPUEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKEN</name>
							<description>ETHCKEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXEN</name>
							<description>ETHTXEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXEN</name>
							<description>ETHRXEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACEN</name>
							<description>ETHMACEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCEN</name>
							<description>FMCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIEN</name>
							<description>QSPIEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1EN</name>
							<description>SDMMC1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2EN</name>
							<description>SDMMC2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1EN</name>
							<description>CRC1EN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHEN</name>
							<description>USBHEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB6ENCLRR</name>
					<displayName>RCC_MC_AHB6ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0x29C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMAEN</name>
							<description>MDMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPUEN</name>
							<description>GPUEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKEN</name>
							<description>ETHCKEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXEN</name>
							<description>ETHTXEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXEN</name>
							<description>ETHRXEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACEN</name>
							<description>ETHMACEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCEN</name>
							<description>FMCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIEN</name>
							<description>QSPIEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1EN</name>
							<description>SDMMC1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2EN</name>
							<description>SDMMC2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1EN</name>
							<description>CRC1EN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHEN</name>
							<description>USBHEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB4LPENSETR</name>
					<displayName>RCC_MP_APB4LPENSETR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
					<addressOffset>0x300</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00118111</resetValue>
					<fields>
						<field>
							<name>LTDCLPEN</name>
							<description>LTDCLPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSILPEN</name>
							<description>DSILPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMLPEN</name>
							<description>DDRPERFMLPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2APBLPEN</name>
							<description>IWDG2APBLPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYLPEN</name>
							<description>USBPHYLPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROLPEN</name>
							<description>STGENROLPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROSTPEN</name>
							<description>STGENROSTPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB4LPENCLRR</name>
					<displayName>RCC_MP_APB4LPENCLRR</displayName>
					<description>This register is used by the MCU</description>
					<addressOffset>0x304</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00118111</resetValue>
					<fields>
						<field>
							<name>LTDCLPEN</name>
							<description>LTDCLPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSILPEN</name>
							<description>DSILPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMLPEN</name>
							<description>DDRPERFMLPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2APBLPEN</name>
							<description>IWDG2APBLPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYLPEN</name>
							<description>USBPHYLPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROLPEN</name>
							<description>STGENROLPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROSTPEN</name>
							<description>STGENROSTPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
