knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>RCC_MC_AHB6LPENSETR</name>
					<displayName>RCC_MC_AHB6LPENSETR</displayName>
					<description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
					<addressOffset>0x398</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x011357A1</resetValue>
					<fields>
						<field>
							<name>MDMALPEN</name>
							<description>MDMALPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPULPEN</name>
							<description>GPULPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKLPEN</name>
							<description>ETHCKLPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXLPEN</name>
							<description>ETHTXLPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXLPEN</name>
							<description>ETHRXLPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACLPEN</name>
							<description>ETHMACLPEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHSTPEN</name>
							<description>ETHSTPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCLPEN</name>
							<description>FMCLPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPILPEN</name>
							<description>QSPILPEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1LPEN</name>
							<description>SDMMC1LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2LPEN</name>
							<description>SDMMC2LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1LPEN</name>
							<description>CRC1LPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHLPEN</name>
							<description>USBHLPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB6LPENCLRR</name>
					<displayName>RCC_MC_AHB6LPENCLRR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
					<addressOffset>0x39C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x011357A1</resetValue>
					<fields>
						<field>
							<name>MDMALPEN</name>
							<description>MDMALPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPULPEN</name>
							<description>GPULPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHCKLPEN</name>
							<description>ETHCKLPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHTXLPEN</name>
							<description>ETHTXLPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHRXLPEN</name>
							<description>ETHRXLPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACLPEN</name>
							<description>ETHMACLPEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHSTPEN</name>
							<description>ETHSTPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCLPEN</name>
							<description>FMCLPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPILPEN</name>
							<description>QSPILPEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1LPEN</name>
							<description>SDMMC1LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2LPEN</name>
							<description>SDMMC2LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1LPEN</name>
							<description>CRC1LPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHLPEN</name>
							<description>USBHLPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_BR_RSTSCLRR</name>
					<displayName>RCC_BR_RSTSCLRR</displayName>
					<description>This register is used by the BOOTROM to check the reset source. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  clears the corresponding bit to . In order to identify the reset source, the MPU application must use RCC MPU Reset Status Clear Register (RCC_MP_RSTSCLRR), and the MCU application must use the RCC MCU Reset Status Clear Register (RCC_MC_RSTSCLRR). Refer to Section10.3.13: Reset source identification for details.This register except MPUP[1:0]RSTF flags is located into VDD domain, and is reset by por_rst reset. The MPUP[1:0]RSTF flags are located into VDDCORE and are reset by nreset. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000015</resetValue>
					<fields>
						<field>
							<name>PORRSTF</name>
							<description>PORRSTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BORRSTF</name>
							<description>BORRSTF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PADRSTF</name>
							<description>PADRSTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HCSSRSTF</name>
							<description>HCSSRSTF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCORERSTF</name>
							<description>VCORERSTF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPSYSRSTF</name>
							<description>MPSYSRSTF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCSYSRSTF</name>
							<description>MCSYSRSTF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG1RSTF</name>
							<description>IWDG1RSTF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2RSTF</name>
							<description>IWDG2RSTF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP0RSTF</name>
							<description>MPUP0RSTF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP1RSTF</name>
							<description>MPUP1RSTF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_GRSTCSETR</name>
					<displayName>RCC_MP_GRSTCSETR</displayName>
					<description>This register is used by the MPU in order to generate either a MCU reset or a system reset or a reset of one of the two MPU processors. Writing  has no effect, reading returns the effective values of the corresponding bits. Writing a  activates the reset.</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSYSRST</name>
							<description>MPSYSRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCURST</name>
							<description>MCURST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP0RST</name>
							<description>MPUP0RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP1RST</name>
							<description>MPUP1RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_RSTSCLRR</name>
					<displayName>RCC_MP_RSTSCLRR</displayName>
					<description>This register is used by the MPU to check the reset source. This register is updated by the BOOTROM code, after a power-on reset (por_rst), a system reset (nreset), or an exit from Standby or CStandby.Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  clears the corresponding bit to .Refer to Section10.3.13: Reset source identification for details.The register is located in VDDCORE.If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PORRSTF</name>
							<description>PORRSTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BORRSTF</name>
							<description>BORRSTF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PADRSTF</name>
							<description>PADRSTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HCSSRSTF</name>
							<description>HCSSRSTF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCORERSTF</name>
							<description>VCORERSTF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPSYSRSTF</name>
							<description>MPSYSRSTF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCSYSRSTF</name>
							<description>MCSYSRSTF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG1RSTF</name>
							<description>IWDG1RSTF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2RSTF</name>
							<description>IWDG2RSTF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STDBYRSTF</name>
							<description>STDBYRSTF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSTDBYRSTF</name>
							<description>CSTDBYRSTF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP0RSTF</name>
							<description>MPUP0RSTF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP1RSTF</name>
							<description>MPUP1RSTF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPARE</name>
							<description>SPARE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_IWDGFZSETR</name>
					<displayName>RCC_MP_IWDGFZSETR</displayName>
					<description>This register is used by the BOOTROM in order to freeze the IWDGs clocks. After a system reset or Standby reset (nreset), or a CStandby reset (cstby_rst) the MPU is allowed to write it once.Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x40C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FZ_IWDG1</name>
							<description>FZ_IWDG1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FZ_IWDG2</name>
							<description>FZ_IWDG2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_IWDGFZCLRR</name>
					<displayName>RCC_MP_IWDGFZCLRR</displayName>
					<description>This register is used by the BOOTROM in order to unfreeze the IWDGs clocks. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  clears the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x410</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FZ_IWDG1</name>
							<description>FZ_IWDG1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FZ_IWDG2</name>
							<description>FZ_IWDG2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_CIER</name>
					<displayName>RCC_MP_CIER</displayName>
					<description>This register shall be used by the MPU to control the interrupt source enable. Refer to Section10.5: RCC interrupts for more details. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x414</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSIRDYIE</name>
							<description>LSIRDYIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDYIE</name>
							<description>LSERDYIE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYIE</name>
							<description>HSIRDYIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYIE</name>
							<description>HSERDYIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSIRDYIE</name>
							<description>CSIRDYIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL1DYIE</name>
							<description>PLL1DYIE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL2DYIE</name>
							<description>PLL2DYIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL3DYIE</name>
							<description>PLL3DYIE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL4DYIE</name>
							<description>PLL4DYIE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSECSSIE</name>
							<description>LSECSSIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WKUPIE</name>
							<description>WKUPIE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_CIFR</name>
					<displayName>RCC_MP_CIFR</displayName>
					<description>This register shall be used by the MPU in order to read and clear the interrupt flags.Writing  has no effect, writing  will clear the corresponding flag.Refer to Section10.5: RCC interrupts for more details. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x418</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSIRDYF</name>
							<description>LSIRDYF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSERDYF</name>
							<description>LSERDYF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYF</name>
							<description>HSIRDYF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYF</name>
							<description>HSERDYF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSIRDYF</name>
							<description>CSIRDYF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL1DYF</name>
							<description>PLL1DYF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL2DYF</name>
							<description>PLL2DYF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL3DYF</name>
							<description>PLL3DYF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLL4DYF</name>
							<description>PLL4DYF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSECSSF</name>
							<description>LSECSSF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WKUPF</name>
							<description>WKUPF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PWRLPDLYCR</name>
					<displayName>RCC_PWRLPDLYCR</displayName>
					<description>This register is used to program the delay between the moment where the system exits from one of the Stop modes, and the moment where it is allowed to enable the PLLs and provide a clock to bridges and processors. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x41C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWRLP_DLY</name>
							<description>PWRLP_DLY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
						</field>
						<field>
							<name>MCTMPSKP</name>
							<description>MCTMPSKP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_RSTSSETR</name>
					<displayName>RCC_MP_RSTSSETR</displayName>
					<description>This register is dedicated to the BOOTROM code in order to update the reset source. This register is updated by the BOOTROM code, after a power-on reset (por_rst), a system reset (nreset), or an exit from Standby or CStandby. The application software shall not use this register. In order to identify the reset source, the MPU application must use RCC MPU Reset Status Clear Register (RCC_MP_RSTSCLRR), and the MCU application must use the RCC MCU Reset Status Clear Register (RCC_MC_RSTSCLRR).Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .Refer to Section10.3.13: Reset source identification for details.The register is located in VDDCORE.If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x420</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PORRSTF</name>
							<description>PORRSTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BORRSTF</name>
							<description>BORRSTF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PADRSTF</name>
							<description>PADRSTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HCSSRSTF</name>
							<description>HCSSRSTF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VCORERSTF</name>
							<description>VCORERSTF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPSYSRSTF</name>
							<description>MPSYSRSTF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCSYSRSTF</name>
							<description>MCSYSRSTF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG1RSTF</name>
							<description>IWDG1RSTF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2RSTF</name>
							<description>IWDG2RSTF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STDBYRSTF</name>
							<description>STDBYRSTF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSTDBYRSTF</name>
							<description>CSTDBYRSTF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP0RSTF</name>
							<description>MPUP0RSTF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUP1RSTF</name>
							<description>MPUP1RSTF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPARE</name>
							<description>SPARE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MCO1CFGR</name>
					<displayName>RCC_MCO1CFGR</displayName>
					<description>This register is used to select the clock generated on MCO1 output.</description>
					<addressOffset>0x800</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCO1SEL</name>
							<description>MCO1SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MCO1DIV</name>
							<description>MCO1DIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MCO1ON</name>
							<description>MCO1ON</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
