knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>RCC_SAI2CKSELR</name>
					<displayName>RCC_SAI2CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SAI2. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8CC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAI2SRC</name>
							<description>SAI2SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SAI3CKSELR</name>
					<displayName>RCC_SAI3CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SAI3. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8D0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAI3SRC</name>
							<description>SAI3SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SAI4CKSELR</name>
					<displayName>RCC_SAI4CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SAI4. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8D4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAI4SRC</name>
							<description>SAI4SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SPI2S1CKSELR</name>
					<displayName>RCC_SPI2S1CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SPI/I2S1. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8D8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI1SRC</name>
							<description>SPI1SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SPI2S23CKSELR</name>
					<displayName>RCC_SPI2S23CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SPI/I2S2,3. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8DC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI23SRC</name>
							<description>SPI23SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SPI45CKSELR</name>
					<displayName>RCC_SPI45CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SPI4,5. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8E0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI45SRC</name>
							<description>SPI45SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_UART6CKSELR</name>
					<displayName>RCC_UART6CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the USART6. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8E4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART6SRC</name>
							<description>UART6SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_UART24CKSELR</name>
					<displayName>RCC_UART24CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the USART2 and UART4. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8E8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART24SRC</name>
							<description>UART24SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_UART35CKSELR</name>
					<displayName>RCC_UART35CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the USART3 and UART5. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8EC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART35SRC</name>
							<description>UART35SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_UART78CKSELR</name>
					<displayName>RCC_UART78CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the UART7 and UART8. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8F0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART78SRC</name>
							<description>UART78SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SDMMC12CKSELR</name>
					<displayName>RCC_SDMMC12CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SDMMC1 and SDMMC2. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8F4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>SDMMC12SRC</name>
							<description>SDMMC12SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SDMMC3CKSELR</name>
					<displayName>RCC_SDMMC3CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SDMMC3. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8F8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SDMMC3SRC</name>
							<description>SDMMC3SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_ETHCKSELR</name>
					<displayName>RCC_ETHCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the ETH block. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8FC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ETHSRC</name>
							<description>ETHSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ETHPTPDIV</name>
							<description>ETHPTPDIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_QSPICKSELR</name>
					<displayName>RCC_QSPICKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the QUADSPI. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x900</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>QSPISRC</name>
							<description>QSPISRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_FMCCKSELR</name>
					<displayName>RCC_FMCCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the FMC block. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x904</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FMCSRC</name>
							<description>FMCSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_FDCANCKSELR</name>
					<displayName>RCC_FDCANCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the FDCAN block. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x90C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FDCANSRC</name>
							<description>FDCANSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SPDIFCKSELR</name>
					<displayName>RCC_SPDIFCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SPDIFRX. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x914</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPDIFSRC</name>
							<description>SPDIFSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CECCKSELR</name>
					<displayName>RCC_CECCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the CEC-HDMI.</description>
					<addressOffset>0x918</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CECSRC</name>
							<description>CECSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_USBCKSELR</name>
					<displayName>RCC_USBCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the USBPHY PLL of the USB HOST and USB OTG</description>
					<addressOffset>0x91C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USBPHYSRC</name>
							<description>USBPHYSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>USBOSRC</name>
							<description>USBOSRC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RNG2CKSELR</name>
					<displayName>RCC_RNG2CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the RNG2.</description>
					<addressOffset>0x920</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RNG2SRC</name>
							<description>RNG2SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_DSICKSELR</name>
					<displayName>RCC_DSICKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the DSI block.</description>
					<addressOffset>0x924</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DSISRC</name>
							<description>DSISRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_ADCCKSELR</name>
					<displayName>RCC_ADCCKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the ADC block.</description>
					<addressOffset>0x928</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADCSRC</name>
							<description>ADCSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_LPTIM45CKSELR</name>
					<displayName>RCC_LPTIM45CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the LPTIM4 and LPTIM5 blocks.</description>
					<addressOffset>0x92C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM45SRC</name>
							<description>LPTIM45SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_LPTIM23CKSELR</name>
					<displayName>RCC_LPTIM23CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the LPTIM2 and LPTIM3 blocks.</description>
					<addressOffset>0x930</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM23SRC</name>
							<description>LPTIM23SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_LPTIM1CKSELR</name>
					<displayName>RCC_LPTIM1CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the LPTIM1 block.</description>
					<addressOffset>0x934</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM1SRC</name>
							<description>LPTIM1SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
