knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>RCC_MC_APB2ENCLRR</name>
					<displayName>RCC_MC_APB2ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xA8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIM1EN</name>
							<description>TIM1EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM8EN</name>
							<description>TIM8EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15EN</name>
							<description>TIM15EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16EN</name>
							<description>TIM16EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17EN</name>
							<description>TIM17EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1EN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI4EN</name>
							<description>SPI4EN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI5EN</name>
							<description>SPI5EN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART6EN</name>
							<description>USART6EN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI1EN</name>
							<description>SAI1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI2EN</name>
							<description>SAI2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI3EN</name>
							<description>SAI3EN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFSDMEN</name>
							<description>DFSDMEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADFSDMEN</name>
							<description>ADFSDMEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FDCANEN</name>
							<description>FDCANEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB3ENSETR</name>
					<displayName>RCC_MC_APB3ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xA90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM2EN</name>
							<description>LPTIM2EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3EN</name>
							<description>LPTIM3EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4EN</name>
							<description>LPTIM4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5EN</name>
							<description>LPTIM5EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4EN</name>
							<description>SAI4EN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGEN</name>
							<description>SYSCFGEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFEN</name>
							<description>VREFEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSEN</name>
							<description>DTSEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDPEN</name>
							<description>HDPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB3ENCLRR</name>
					<displayName>RCC_MC_APB3ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xA94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM2EN</name>
							<description>LPTIM2EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3EN</name>
							<description>LPTIM3EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4EN</name>
							<description>LPTIM4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5EN</name>
							<description>LPTIM5EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4EN</name>
							<description>SAI4EN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGEN</name>
							<description>SYSCFGEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFEN</name>
							<description>VREFEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSEN</name>
							<description>DTSEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDPEN</name>
							<description>HDPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB2ENSETR</name>
					<displayName>RCC_MC_AHB2ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xA98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA1EN</name>
							<description>DMA1EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2EN</name>
							<description>DMA2EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMUXEN</name>
							<description>DMAMUXEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC12EN</name>
							<description>ADC12EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBOEN</name>
							<description>USBOEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC3EN</name>
							<description>SDMMC3EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB2ENCLRR</name>
					<displayName>RCC_MC_AHB2ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xA9C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA1EN</name>
							<description>DMA1EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2EN</name>
							<description>DMA2EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMUXEN</name>
							<description>DMAMUXEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC12EN</name>
							<description>ADC12EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBOEN</name>
							<description>USBOEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC3EN</name>
							<description>SDMMC3EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB3ENSETR</name>
					<displayName>RCC_MC_AHB3ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xAA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCMIEN</name>
							<description>DCMIEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP2EN</name>
							<description>CRYP2EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH2EN</name>
							<description>HASH2EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG2EN</name>
							<description>RNG2EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC2EN</name>
							<description>CRC2EN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEMEN</name>
							<description>HSEMEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPCCEN</name>
							<description>IPCCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB3ENCLRR</name>
					<displayName>RCC_MC_AHB3ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xAA4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCMIEN</name>
							<description>DCMIEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP2EN</name>
							<description>CRYP2EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH2EN</name>
							<description>HASH2EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG2EN</name>
							<description>RNG2EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC2EN</name>
							<description>CRC2EN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEMEN</name>
							<description>HSEMEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPCCEN</name>
							<description>IPCCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB4ENSETR</name>
					<displayName>RCC_MC_AHB4ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xAA8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOAEN</name>
							<description>GPIOAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBEN</name>
							<description>GPIOBEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOCEN</name>
							<description>GPIOCEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIODEN</name>
							<description>GPIODEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOEEN</name>
							<description>GPIOEEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOFEN</name>
							<description>GPIOFEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOGEN</name>
							<description>GPIOGEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOHEN</name>
							<description>GPIOHEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOIEN</name>
							<description>GPIOIEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOJEN</name>
							<description>GPIOJEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOKEN</name>
							<description>GPIOKEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB4ENCLRR</name>
					<displayName>RCC_MC_AHB4ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xAAC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOAEN</name>
							<description>GPIOAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBEN</name>
							<description>GPIOBEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOCEN</name>
							<description>GPIOCEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIODEN</name>
							<description>GPIODEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOEEN</name>
							<description>GPIOEEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOFEN</name>
							<description>GPIOFEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOGEN</name>
							<description>GPIOGEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOHEN</name>
							<description>GPIOHEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOIEN</name>
							<description>GPIOIEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOJEN</name>
							<description>GPIOJEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOKEN</name>
							<description>GPIOKEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AXIMENSETR</name>
					<displayName>RCC_MC_AXIMENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xAB0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSRAMEN</name>
							<description>SYSRAMEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AXIMENCLRR</name>
					<displayName>RCC_MC_AXIMENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xAB4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSRAMEN</name>
							<description>SYSRAMEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_MLAHBENSETR</name>
					<displayName>RCC_MC_MLAHBENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit</description>
					<addressOffset>0xAB8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000010</resetValue>
					<fields>
						<field>
							<name>RETRAMEN</name>
							<description>RETRAMEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_MLAHBENCLRR</name>
					<displayName>RCC_MC_MLAHBENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit</description>
					<addressOffset>0xABC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000010</resetValue>
					<fields>
						<field>
							<name>RETRAMEN</name>
							<description>RETRAMEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB1LPENSETR</name>
					<displayName>RCC_MP_APB1LPENSETR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
					<addressOffset>0xB00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xADEFDBFF</resetValue>
					<fields>
						<field>
							<name>TIM2LPEN</name>
							<description>TIM2LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3LPEN</name>
							<description>TIM3LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4LPEN</name>
							<description>TIM4LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM5LPEN</name>
							<description>TIM5LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6LPEN</name>
							<description>TIM6LPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7LPEN</name>
							<description>TIM7LPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM12LPEN</name>
							<description>TIM12LPEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM13LPEN</name>
							<description>TIM13LPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14LPEN</name>
							<description>TIM14LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM1LPEN</name>
							<description>LPTIM1LPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2LPEN</name>
							<description>SPI2LPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3LPEN</name>
							<description>SPI3LPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2LPEN</name>
							<description>USART2LPEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3LPEN</name>
							<description>USART3LPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4LPEN</name>
							<description>UART4LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5LPEN</name>
							<description>UART5LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART7LPEN</name>
							<description>UART7LPEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART8LPEN</name>
							<description>UART8LPEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1LPEN</name>
							<description>I2C1LPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2LPEN</name>
							<description>I2C2LPEN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C3LPEN</name>
							<description>I2C3LPEN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C5LPEN</name>
							<description>I2C5LPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPDIFLPEN</name>
							<description>SPDIFLPEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CECLPEN</name>
							<description>CECLPEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC12LPEN</name>
							<description>DAC12LPEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDIOSLPEN</name>
							<description>MDIOSLPEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
