knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
				<register>
					<name>RCC_MP_AXIMLPENSETR</name>
					<displayName>RCC_MP_AXIMLPENSETR</displayName>
					<description>This register is used by the MPU </description>
					<addressOffset>0xB30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SYSRAMLPEN</name>
							<description>SYSRAMLPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_AXIMLPENCLRR</name>
					<displayName>RCC_MP_AXIMLPENCLRR</displayName>
					<description>This register is used by the MPU</description>
					<addressOffset>0xB34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SYSRAMLPEN</name>
							<description>SYSRAMLPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_MLAHBLPENSETR</name>
					<displayName>RCC_MP_MLAHBLPENSETR</displayName>
					<description>This register is used by the MPU in order to set the PERxLPEN bit</description>
					<addressOffset>0xB38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000017</resetValue>
					<fields>
						<field>
							<name>SRAM1LPEN</name>
							<description>SRAM1LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM2LPEN</name>
							<description>SRAM2LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM34LPEN</name>
							<description>SRAM34LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RETRAMLPEN</name>
							<description>RETRAMLPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_MLAHBLPENCLRR</name>
					<displayName>RCC_MP_MLAHBLPENCLRR</displayName>
					<description>This register is used by the MPU in order to clear the PERxLPEN bit </description>
					<addressOffset>0xB3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000017</resetValue>
					<fields>
						<field>
							<name>SRAM1LPEN</name>
							<description>SRAM1LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM2LPEN</name>
							<description>SRAM2LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM34LPEN</name>
							<description>SRAM34LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RETRAMLPEN</name>
							<description>RETRAMLPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB1LPENSETR</name>
					<displayName>RCC_MC_APB1LPENSETR</displayName>
					<description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
					<addressOffset>0xB80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xBDEFDBFF</resetValue>
					<fields>
						<field>
							<name>TIM2LPEN</name>
							<description>TIM2LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3LPEN</name>
							<description>TIM3LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4LPEN</name>
							<description>TIM4LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM5LPEN</name>
							<description>TIM5LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6LPEN</name>
							<description>TIM6LPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7LPEN</name>
							<description>TIM7LPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM12LPEN</name>
							<description>TIM12LPEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM13LPEN</name>
							<description>TIM13LPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14LPEN</name>
							<description>TIM14LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM1LPEN</name>
							<description>LPTIM1LPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2LPEN</name>
							<description>SPI2LPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3LPEN</name>
							<description>SPI3LPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2LPEN</name>
							<description>USART2LPEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3LPEN</name>
							<description>USART3LPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4LPEN</name>
							<description>UART4LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5LPEN</name>
							<description>UART5LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART7LPEN</name>
							<description>UART7LPEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART8LPEN</name>
							<description>UART8LPEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1LPEN</name>
							<description>I2C1LPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2LPEN</name>
							<description>I2C2LPEN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C3LPEN</name>
							<description>I2C3LPEN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C5LPEN</name>
							<description>I2C5LPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPDIFLPEN</name>
							<description>SPDIFLPEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CECLPEN</name>
							<description>CECLPEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDG1LPEN</name>
							<description>WWDG1LPEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC12LPEN</name>
							<description>DAC12LPEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDIOSLPEN</name>
							<description>MDIOSLPEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB1LPENCLRR</name>
					<displayName>RCC_MC_APB1LPENCLRR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
					<addressOffset>0xB84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xBDEFDBFF</resetValue>
					<fields>
						<field>
							<name>TIM2LPEN</name>
							<description>TIM2LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3LPEN</name>
							<description>TIM3LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4LPEN</name>
							<description>TIM4LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM5LPEN</name>
							<description>TIM5LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6LPEN</name>
							<description>TIM6LPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7LPEN</name>
							<description>TIM7LPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM12LPEN</name>
							<description>TIM12LPEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM13LPEN</name>
							<description>TIM13LPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14LPEN</name>
							<description>TIM14LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM1LPEN</name>
							<description>LPTIM1LPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2LPEN</name>
							<description>SPI2LPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3LPEN</name>
							<description>SPI3LPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2LPEN</name>
							<description>USART2LPEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3LPEN</name>
							<description>USART3LPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4LPEN</name>
							<description>UART4LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5LPEN</name>
							<description>UART5LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART7LPEN</name>
							<description>UART7LPEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART8LPEN</name>
							<description>UART8LPEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1LPEN</name>
							<description>I2C1LPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2LPEN</name>
							<description>I2C2LPEN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C3LPEN</name>
							<description>I2C3LPEN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C5LPEN</name>
							<description>I2C5LPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPDIFLPEN</name>
							<description>SPDIFLPEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CECLPEN</name>
							<description>CECLPEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDG1LPEN</name>
							<description>WWDG1LPEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC12LPEN</name>
							<description>DAC12LPEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDIOSLPEN</name>
							<description>MDIOSLPEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB2LPENSETR</name>
					<displayName>RCC_MC_APB2LPENSETR</displayName>
					<description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
					<addressOffset>0xB88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0137271F</resetValue>
					<fields>
						<field>
							<name>TIM1LPEN</name>
							<description>TIM1LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM8LPEN</name>
							<description>TIM8LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15LPEN</name>
							<description>TIM15LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16LPEN</name>
							<description>TIM16LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17LPEN</name>
							<description>TIM17LPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1LPEN</name>
							<description>SPI1LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI4LPEN</name>
							<description>SPI4LPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI5LPEN</name>
							<description>SPI5LPEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART6LPEN</name>
							<description>USART6LPEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI1LPEN</name>
							<description>SAI1LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI2LPEN</name>
							<description>SAI2LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI3LPEN</name>
							<description>SAI3LPEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFSDMLPEN</name>
							<description>DFSDMLPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADFSDMLPEN</name>
							<description>ADFSDMLPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FDCANLPEN</name>
							<description>FDCANLPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB2LPENCLRR</name>
					<displayName>RCC_MC_APB2LPENCLRR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
					<addressOffset>0xB8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0137271F</resetValue>
					<fields>
						<field>
							<name>TIM1LPEN</name>
							<description>TIM1LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM8LPEN</name>
							<description>TIM8LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15LPEN</name>
							<description>TIM15LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16LPEN</name>
							<description>TIM16LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17LPEN</name>
							<description>TIM17LPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1LPEN</name>
							<description>SPI1LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI4LPEN</name>
							<description>SPI4LPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI5LPEN</name>
							<description>SPI5LPEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART6LPEN</name>
							<description>USART6LPEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI1LPEN</name>
							<description>SAI1LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI2LPEN</name>
							<description>SAI2LPEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI3LPEN</name>
							<description>SAI3LPEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFSDMLPEN</name>
							<description>DFSDMLPEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADFSDMLPEN</name>
							<description>ADFSDMLPEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FDCANLPEN</name>
							<description>FDCANLPEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB3LPENSETR</name>
					<displayName>RCC_MC_APB3LPENSETR</displayName>
					<description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
					<addressOffset>0xB90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0003290F</resetValue>
					<fields>
						<field>
							<name>LPTIM2LPEN</name>
							<description>LPTIM2LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3LPEN</name>
							<description>LPTIM3LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4LPEN</name>
							<description>LPTIM4LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5LPEN</name>
							<description>LPTIM5LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4LPEN</name>
							<description>SAI4LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGLPEN</name>
							<description>SYSCFGLPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFLPEN</name>
							<description>VREFLPEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSLPEN</name>
							<description>DTSLPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_APB3LPENCLRR</name>
					<displayName>RCC_MC_APB3LPENCLRR</displayName>
					<description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
					<addressOffset>0xB94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0003290F</resetValue>
					<fields>
						<field>
							<name>LPTIM2LPEN</name>
							<description>LPTIM2LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3LPEN</name>
							<description>LPTIM3LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4LPEN</name>
							<description>LPTIM4LPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5LPEN</name>
							<description>LPTIM5LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4LPEN</name>
							<description>SAI4LPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGLPEN</name>
							<description>SYSCFGLPEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFLPEN</name>
							<description>VREFLPEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSLPEN</name>
							<description>DTSLPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MC_AHB2LPENSETR</name>
					<displayName>RCC_MC_AHB2LPENSETR</displayName>
					<description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
					<addressOffset>0xB98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010127</resetValue>
					<fields>
						<field>
							<name>DMA1LPEN</name>
							<description>DMA1LPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2LPEN</name>
							<description>DMA2LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMUXLPEN</name>
							<description>DMAMUXLPEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC12LPEN</name>
							<description>ADC12LPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBOLPEN</name>
							<description>USBOLPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC3LPEN</name>
							<description>SDMMC3LPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
