knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>     
	  <disableCondition>RCC->RCC_MC_APB1ENSETR->SPI2EN == 0</disableCondition>
      <baseAddress>0x4000B000</baseAddress>   
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>36</value>
      </interrupt>	  
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
	  <disableCondition>RCC->RCC_MC_APB1ENSETR->SPI3EN == 0</disableCondition>
      <baseAddress>0x4000C000</baseAddress>
	  <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI4</name>
	  <disableCondition>RCC->RCC_MC_APB2ENSETR->SPI4EN == 0</disableCondition>
      <baseAddress>0x44005000</baseAddress>
	  <interrupt>
        <name>SPI4</name>
        <description>SPI4 global interrupt</description>
        <value>84</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI5</name>
	  <disableCondition>RCC->RCC_MC_APB2ENSETR->SPI5EN == 0</disableCondition>
      <baseAddress>0x44009000</baseAddress>
	  <interrupt>
        <name>SPI5</name>
        <description>SPI5 global interrupt</description>
        <value>85</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI6</name>
	  <disableCondition>RCC->RCC_MC_APB5ENSETR->SPI6EN == 0</disableCondition>
      <baseAddress>0x5C001000</baseAddress>
	  <interrupt>
        <name>SPI6</name>
        <description>SPI6 global interrupt</description>
        <value>86</value>
      </interrupt>
    </peripheral>
	<peripheral>
      <name>STGENC</name>
      <description>STGENC</description>
      <groupName>STGENC</groupName>
	  <disableCondition>RCC->RCC_MC_APB5ENSETR->STGENEN == 0</disableCondition>
      <baseAddress>0x5C008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STGENC_CNTCR</name>
          <displayName>STGENC_CNTCR</displayName>
          <description>STGENC control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HLTDBG</name>
              <description>HLTDBG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CNTSR</name>
          <displayName>STGENC_CNTSR</displayName>
          <description>STGENC status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HLTDBG</name>
              <description>HLTDBG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CNTCVL</name>
          <displayName>STGENC_CNTCVL</displayName>
          <description>the control interface must clear the STGENC_CNTCR.EN bit before writing to this register.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTCVL_L_32</name>
              <description>CNTCVL_L_32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CNTCVU</name>
          <displayName>STGENC_CNTCVU</displayName>
          <description>the control interface must clear the STGENC_CNTCR.EN bit before writing to this register.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTCVU_U_32</name>
              <description>CNTCVU_U_32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CNTFID0</name>
          <displayName>STGENC_CNTFID0</displayName>
          <description>the control interface must clear the STGEN_CNTCR.EN bit before writing to this register.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FREQ</name>
              <description>FREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR4</name>
          <displayName>STGENC_PIDR4</displayName>
          <description>STGENC peripheral ID4 register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>DES_2</name>
              <description>DES_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>SIZE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR5</name>
          <displayName>STGENC_PIDR5</displayName>
          <description>STGENC peripheral ID5 register</description>
          <addressOffset>0xFD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR5</name>
              <description>PIDR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR6</name>
          <displayName>STGENC_PIDR6</displayName>
          <description>STGENC peripheral ID6 register</description>
          <addressOffset>0xFD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR6</name>
              <description>PIDR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR7</name>
          <displayName>STGENC_PIDR7</displayName>
          <description>STGENC peripheral ID7 register</description>
          <addressOffset>0xFDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR7</name>
              <description>PIDR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR0</name>
          <displayName>STGENC_PIDR0</displayName>
          <description>STGENC peripheral ID0 register</description>
          <addressOffset>0xFE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>PART_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR1</name>
          <displayName>STGENC_PIDR1</displayName>
          <description>STGENC peripheral ID1 register</description>
          <addressOffset>0xFE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PART_1</name>
              <description>PART_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DES_0</name>
              <description>DES_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR2</name>
          <displayName>STGENC_PIDR2</displayName>
          <description>STGENC peripheral ID2 register</description>
          <addressOffset>0xFE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>DES_1</name>
              <description>DES_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JEDEC</name>
              <description>JEDEC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_PIDR3</name>
          <displayName>STGENC_PIDR3</displayName>
          <description>STGENC peripheral ID3 register</description>
          <addressOffset>0xFEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMOD</name>
              <description>CMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REVAND</name>
              <description>REVAND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CIDR0</name>
          <displayName>STGENC_CIDR0</displayName>
          <description>STGENC component ID0 register</description>
          <addressOffset>0xFF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>PRMBL_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CIDR1</name>
          <displayName>STGENC_CIDR1</displayName>
          <description>STGENC component ID1 register</description>
          <addressOffset>0xFF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000F0</resetValue>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>PRMBL_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLASS</name>
              <description>CLASS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CIDR2</name>
          <displayName>STGENC_CIDR2</displayName>
          <description>STGENC component ID2 register</description>
          <addressOffset>0xFF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>PRMBL_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STGENC_CIDR3</name>
          <displayName>STGENC_CIDR3</displayName>
          <description>STGENC component ID3 register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>PRMBL_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
