knieriem/tinygo-stm32-svd/svd/stm32mp151x.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17</name>
	  <disableCondition>RCC->RCC_MC_APB2ENSETR->TIM17EN == 0</disableCondition>
      <baseAddress>0x44008000</baseAddress>
	   <interrupt>
        <name>TIM17</name>
        <description>TIM17 global interrupt</description>
        <value>118</value>
      </interrupt>
    </peripheral>
	<peripheral>
      <name>TZC</name>
      <description>TZC</description>
      <groupName>TZC</groupName>
	  <disableCondition>RCC->RCC_MC_APB5ENSETR->TZC1EN == 0</disableCondition>
      <baseAddress>0x5C006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
	   <interrupt>
        <name>TZC_IT</name>
        <description>TrustZone DDR address space controller</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>TZC_BUILD_CONFIG</name>
          <displayName>TZC_BUILD_CONFIG</displayName>
          <description>Provides information about TZC configuration.</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x01001F08</resetValue>
          <fields>
            <field>
              <name>NO_OF_REGIONS</name>
              <description>NO_OF_REGIONS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDRESS_WIDTH</name>
              <description>ADDRESS_WIDTH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NO_OF_FILTERS</name>
              <description>NO_OF_FILTERS</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_ACTION</name>
          <displayName>TZC_ACTION</displayName>
          <description>Controls interrupt and bus error response behavior when regions permission failures occur.</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REACTION_VALUE</name>
              <description>REACTION_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_GATE_KEEPER</name>
          <displayName>TZC_GATE_KEEPER</displayName>
          <description>Provides control and status for the gate keeper in each filter unit implemented.</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPENREQ</name>
              <description>OPENREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPENSTAT</name>
              <description>OPENSTAT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_SPECULATION_CTRL</name>
          <displayName>TZC_SPECULATION_CTRL</displayName>
          <description>Controls read and write access speculation.</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READSPEC_DISABLE</name>
              <description>READSPEC_DISABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITESPEC_DISABLE</name>
              <description>WRITESPEC_DISABLE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_INT_STATUS</name>
          <displayName>TZC_INT_STATUS</displayName>
          <description>Contains the status of the interrupt signal, TZCINT, that reports access security violations or region overlap errors.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>STATUS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>OVERRUN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERLAP</name>
              <description>OVERLAP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_INT_CLEAR</name>
          <displayName>TZC_INT_CLEAR</displayName>
          <description>Interrupt clear for each filter.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>CLEAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_FAIL_CONTROL0</name>
          <displayName>TZC_FAIL_CONTROL0</displayName>
          <description>Status information about the first access that failed a region permission check in the associated filter (0 to 1).</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIVILEGE</name>
              <description>PRIVILEGE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NON_SECURE</name>
              <description>NON_SECURE</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRECTION</name>
              <description>DIRECTION</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_FAIL_ID0</name>
          <displayName>TZC_FAIL_ID0</displayName>
          <description>Contains the master AXI ARID or AWID of the first access that failed a region permission check in the associated filter unit. This occurs even if the ACTION register is set to not drive the interrupt signal.
AXI ID mapping is described in Table4: NSAID definition table (TBD).</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_FAIL_CONTROL1</name>
          <displayName>TZC_FAIL_CONTROL1</displayName>
          <description>Status information about the first access that failed a region permission check in the associated filter (0 to 1).</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIVILEGE</name>
              <description>PRIVILEGE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NON_SECURE</name>
              <description>NON_SECURE</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRECTION</name>
              <description>DIRECTION</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_FAIL_ID1</name>
          <displayName>TZC_FAIL_ID1</displayName>
          <description>Contains the master AXI ARID or AWID of the first access that failed a region permission check in the associated filter unit. This occurs even if the ACTION register is set to not drive the interrupt signal.
AXI ID mapping is described in Table4: NSAID definition table (TBD).</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE0</name>
          <displayName>TZC_REGION_ATTRIBUTE0</displayName>
          <description>Region 0 attributes.</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE1</name>
          <displayName>TZC_REGION_ATTRIBUTE1</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE2</name>
          <displayName>TZC_REGION_ATTRIBUTE2</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE3</name>
          <displayName>TZC_REGION_ATTRIBUTE3</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE4</name>
          <displayName>TZC_REGION_ATTRIBUTE4</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE5</name>
          <displayName>TZC_REGION_ATTRIBUTE5</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE6</name>
          <displayName>TZC_REGION_ATTRIBUTE6</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE7</name>
          <displayName>TZC_REGION_ATTRIBUTE7</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_REGION_ATTRIBUTE8</name>
          <displayName>TZC_REGION_ATTRIBUTE8</displayName>
          <description>Region x attributes.</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>FILTER_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_RD_EN</name>
              <description>S_RD_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_WR_EN</name>
              <description>S_WR_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_PID4</name>
          <displayName>TZC_PID4</displayName>
          <description>Peripheral ID 4.</description>
          <addressOffset>0xFD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PER_ID_4</name>
              <description>PER_ID_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_PID5</name>
          <displayName>TZC_PID5</displayName>
          <description>Peripheral ID 5.</description>
          <addressOffset>0xFD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_ID_5</name>
              <description>PER_ID_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_PID6</name>
          <displayName>TZC_PID6</displayName>
          <description>Peripheral ID 6.</description>
          <addressOffset>0xFD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_ID_6</name>
              <description>PER_ID_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_PID7</name>
          <displayName>TZC_PID7</displayName>
          <description>Peripheral ID 7.</description>
          <addressOffset>0xFDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_ID_7</name>
              <description>PER_ID_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZC_PID0</name>
          <displayName>TZC_PID0</displayName>
          <description>Peripheral ID 0.</description>
          <addressOffset>0xFE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000060</resetValue>
          <fields>
            <field>
              <name>PER_ID_0</name>
              <description>PER_ID_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
